Repository: KDE/kexi
Catalog: po/*/kexi.po
Languages: eo

# @info donate to the project
source: <title>KEXI may be totally free, but its development is costly.</title><para>Power, hardware, office space, internet access, traveling for meetings - everything costs.</para><para>Direct donation is the easiest and fastest way to efficiently support the KEXI Project. Everyone, regardless of any degree of involvement can do so.</para><para>What do you receive for your donation? KEXI will become more feature-full and stable as contributors will be able to devote more time to KEXI. Not only you can expect new features, but you can also have an influence on what features are added!</para><para>Currently we are accepting donations through <emphasis>BountySource</emphasis> (a funding platform for open-source software) using secure PayPal, Bitcoin and Google Wallet transfers.</para><para>Contact us at <link url='https://community.kde.org/Kexi/Contact'>https://community.kde.org/Kexi/Contact</link> for more information.</para><para>Thanks for your support!</para>
eo: <title>KEXI povas esti tute senpaga, sed ĝia evoluo estas multekosta.</title><para>Potenco, aparataro, oficeja spaco, interreta aliro, vojaĝado por kunvenoj - ĉio kostas.</para><para>Rekta donaco estas la plej facila kaj rapida maniero por efike subteni la Projekton KEXI. Ĉiuj, sendepende de ajna grado de implikiĝo povas fari tion.</para><para>Kion vi ricevas por via donaco? KEXI fariĝos pli plenplena kaj stabila ĉar kontribuantoj povos dediĉi pli da tempo al KEXI. Ne nur vi povas atendi novajn funkciojn, sed vi ankaŭ povas influi, kiaj funkcioj estas aldonitaj!</para><para >Nuntempe ni akceptas donacojn per <emphasis>BountySource</emphasis> (financa platformo por malferma fonto). programaro) uzante sekurajn translokojn de PayPal, Bitcoin kaj Google Wallet.</para><para>Kontaku nin ĉe <link url='https://community.kde.org/Kexi/Contact'>https://community.kde. org/Kexi/Contact</link> por pliaj informoj.</para><para>Dankon pro via subteno!</para>

source: Donate to the Project
eo: Donaci al la Projekto

# @action:button Go to Donation
source: Proceed to the Donation Web Page
eo: Iri al la Reta Paĝo de Donacoj

# Do not donate now
source: Not Now
eo: Ne nun

source: Column %1
eo: Kolumno %1

source: Type
eo: Tipo

source: Primary Key
eo: Primara Ŝlosilo

# @title:window
source: Advanced Import Options
eo: Altnivelaj Import-Ebloj

# @info
source: <title>Text encoding for Microsoft Access database</title> <para>Database file <filename>%1</filename> appears to be created by a version of Microsoft Access older than 2000.</para><para>In order to properly import national characters, you may need to choose a proper text encoding if the database was created on a computer with a different character set.</para>
eo: <title>Tekstokodado por Microsoft Access-datumbazo</title> <para>Datumbaza dosiero <filename>%1</filename> ŝajnas esti kreita de versio de Microsoft Access pli malnova ol 2000.</para><para> Por ĝuste importi naciajn signojn, vi eble devos elekti taŭgan tekstokodigon se la datumbazo estis kreita en komputilo kun malsama signaro.</para>

source: Text encoding:
eo: Tekstokodado:

source: Always use this encoding in similar situations
eo: Ĉiam uzu ĉi tiun kodigon en similaj situacioj

# @info
source: <resource>%1</resource> name is already used by an existing table. Enter different table name to continue.
eo: <resource>%1</resource> nomo jam estas uzata de ekzistanta tabelo. Enigu malsaman tabelnomon por daŭrigi.

source: Name Already Used
eo: Nomo Jam Uzita

# @info
source: <para>Table Importing Assistant allows you to import a table from an existing database into the current KEXI project.</para><para>Click <interface>Next</interface> button to continue or <interface>Cancel</interface> button to exit this assistant.</para>
eo: <para >Tabel Importing Assistant permesas importi tabelon el ekzistanta datumbazo en la nunan KEXI-projekton.</para><para>Alklaku <interface>Sekva</interface> butonon por daŭrigi aŭ <interface>Nuligi</interface> butono por eliri ĉi tiun asistanton.</para>

source: Welcome to the Table Importing Assistant
eo: Bonvenon al la Tabelimporta Asistanto

source: Select Location for Source Database
eo: Elekti Lokon por Fonta Datumbazo

source: Select Source Database
eo: Elekti Fontan datumbazon

source: Select the Table to Import
eo: Elekti la Tabelon Importendan

source: Advanced Options
eo: Pliaj opcioj

source: Importing
eo: Importado

source: Alter the Detected Table Design
eo: Ŝanĝi la Detektitan Tabel-Dezajnon

source: Processing Import
eo: Prilaborante Importon

source: Open imported table
eo: Malfermi importitan tabelon

source: Success
eo: Sukceso

source: Select source database you wish to import:
eo: Elektu fontan datumbazon, kiun vi volas importi:

# @info
source: Could not import table <resource>%1</resource>. Select different table or cancel importing.
eo: Ne eblis importi tabelon <resource>%1</resource>. Elektu malsaman tabelon aŭ nuligu importadon.

# @info
source: No data has been found in table <resource>%1</resource>. Select different table or cancel importing.
eo: Neniuj datumoj estas trovitaj en tabelo <resource>%1</resource>. Elektu malsaman tabelon aŭ nuligu importadon.

# @info Table import wizard, final message
source: <para>All required information has now been gathered. Click <interface>Next</interface> button to start importing table <resource>%1</resource>.</para><para><note>Depending on size of the table this may take some time.</note></para>
eo: <para>Ĉiuj bezonataj informoj nun estas kolektitaj. Alklaku la butonon <interface>Sekva</interface> por komenci importi tabelon <resource>%1</resource>.</para><para><note>Depende de la grandeco de la tabelo tio povas daŭri iom da tempo.</note> </para>

# @info
source: Please wait while the table is imported.
eo: Bonvolu atendi dum la tabelo estas importita.

# @info
source: Table <resource>%1</resource> has been imported.
eo: Tabelo <resource>%1</resource> estis importita.

source: Failure
eo: Fiasko

source: An error occurred.
eo: Eraro okazis.

source: No appropriate migration driver found.
eo: Neniu taŭga transmigra pelilo trovita.

source: No project available.
eo: Neniu projekto disponebla.

source: No table was selected to import.
eo: Neniu tabelo estis elektita por importi.

# @info
source: Unable to create table <resource>%1</resource>.
eo: Ne eblas krei tabelon <resource>%1</resource>.

# @title:window
source: Import Database
eo: Importi datumbazon

# @info
source: Database Importing Assistant is about to import <resource>%1</resource> database (connection <resource>%2</resource>) into a KEXI project.
eo: Asistanto por Importi Datumarojn estas importontaj <resource>%1</resource> datumbazon (konekto <resource>%2</resource>) en projekton de KEXI.

# @info
source: Database Importing Assistant is about to import <filename>%1</filename> file of type <resource>%2</resource> into a KEXI project.
eo: Asistanto por Importi Datumaron estas importonta <filename>%1</filename> dosieron de tipo <resource>%2</resource> en KEXI-projekton.

# @info
source: Database Importing Assistant allows you to import an existing database into a KEXI project.
eo: Database Importing Assistant permesas importi ekzistantan datumbazon en projekton de KEXI.

# @info
source: <para>Click <interface>Next</interface> button to continue or <interface>Cancel</interface> button to exit this assistant.</para>
eo: <para>Alklaku la butonon <interface>Sekva</interface> por daŭrigi aŭ la butonon <interface>Nuligi</interface> por eliri ĉi tiun asistanton.</para>

source: Welcome to the Database Importing Assistant
eo: Bonvenon al la Asistanto por Importi Datumarojn

source: Destination database type:
eo: Cella datumbaza tipo:

source: Database project stored in a file
eo: Datumbaza projekto konservita en dosiero

source: Database project stored on a server
eo: Datumbaza projekto stokita sur servilo

source: Select Destination Database Type
eo: Elekti Cel-Datumbazan Tipon

source: Destination project's caption:
eo: Titolo de la celprojekto:

source: Destination project's name:
eo: Nomo de la celprojekto:

source: Enter Destination Database Project's Caption
eo: Enigu la Subtitolon de la Projekto-Datumbaza Destinita

source: Select Location for Destination Database Project
eo: Elektu Lokon por Destina Datumbaza Projekto

# Scope of import
source: Structure and data
eo: Strukturo kaj datumoj

# Scope of import
source: Structure only
eo: Nur strukturo

source: Select Scope of Import
eo: Elekti Amplekson de Importo

source: Open imported project
eo: Malfermi importitan projekton

# @info
source: <para>No new database name was entered.</para>
eo: <para>Neniu nova datumbaza nomo estis enigita.</para>

# @info
source: %1<para>Source database is the same as destination.</para>
eo: %1<para>Fonta datumbazo estas sama kiel celo.</para>

# @info
source: <para>Following issues were found with the data you entered:</para>%1<para>Please click <interface>Back</interface> button and correct these issues.</para>
eo: <para>Sekvaj problemoj estis trovitaj kun la datumoj kiujn vi enigis:</para>%1<para>Bonvolu klaki la butonon <interface>Reen</interface> kaj korekti ĉi tiujn problemojn.</para>

# @info
source: <para>All required information has now been gathered. Click <interface>Next</interface> button to start importing.</para><para><note>Depending on size of the database this may take some time.</note></para>
eo: <para>Ĉiuj bezonataj informoj nun estas kolektitaj. Alklaku la butonon <interface>Sekva</interface> por komenci la importadon.</para><para><note>Laŭ la grandeco de la datumbazo tio povas daŭri iom da tempo.</note></para>

# @info (don't add tags around %1, it's done already)
source: <para>Database %1 already exists.</para><para>Do you want to replace it with a new one?</para>
eo: <para >La datumbazo %1 jam ekzistas.</para><para >Ĉu vi volas anstataŭigi ĝin per nova?</para>

# @action:button Replace Database
source: &Replace
eo: &Anstataŭigi

# @info
source: <para>Import failed.</para><para>%1</para><para>%2</para><para>You can click <interface>Back</interface> button and try again.</para>
eo: <para >Importado malsukcesis.</para><para >%1</para><para >%2</para><para >Vi povas klaki <interface>Reen</interface> butonon kaj provi denove.</para >

source: Select source database filename.
eo: Elektu fontan datumbazan dosiernomon.

source: Select source database.
eo: Elektu fontan datumbazon.

source: Could not import database. This type is not supported.
eo: Ne eblis importi datumbazon. Ĉi tiu tipo ne estas subtenata.

# @info
source: Could not import database <resource>%1</resource>. This type is not supported.
eo: Ne eblis importi datumbazon <resource>%1</resource>. Ĉi tiu tipo ne estas subtenata.

source: Importing in progress...
eo: Importado en progreso...

# @info
source: Database has been imported into KEXI project <resource>%1</resource>.
eo: Datumaro estis importita en KEXI-projekton <resource>%1</resource>.

source: No help is available for this page.
eo: Neniu helpo disponeblas por ĉi tiu paĝo.

source: Here you can choose the location to import data from.
eo: Ĉi tie vi povas elekti la lokon por importi datumojn.

source: Here you can choose the actual database to import data from.
eo: Ĉi tie vi povas elekti la realan datumbazon por importi datumojn.

source: Here you can choose the location to save the data.
eo: Ĉi tie vi povas elekti la lokon por konservi la datumojn.

source: Here you can choose the location to save the data in and the new database name.
eo: Ĉi tie vi povas elekti la lokon por konservi la datumojn kaj la novan datumbazan nomon.

# @info
source: Could not create database <resource>%1</resource>.
eo: Ne eblis krei datumbazon <resource>%1</resource>.

source: Could not connect to database %1.
eo: Ne eblis konekti al datumbazo %1.

source: Could not get a list of table names for database %1.
eo: Ne eblis ricevi liston de tabelnomoj por datumbazo %1.

source: No tables have been found in database %1.
eo: Neniuj tabeloj estis trovitaj en datumbazo %1.

# @info
source: Could not import project from database %1. Error reading table <resource>%2</resource>.
eo: Ne eblis importi projekton el datumbazo %1. Eraro legante tabelon <resource>%2</resource>.

# @info
source: Could not import table <resource>%1</resource>.
eo: Ne eblis importi tabelon <resource>%1</resource>.

source: Could not import project from data source %1.
eo: Ne eblis importi projekton el datumfonto %1.

# @info
source: Could not copy table <resource>%1</resource> to destination database.
eo: Ne eblis kopii tabelon <resource>%1</resource> al celdatumbazo.

source: Could not import data from data source %1.
eo: Ne eblis importi datumojn de datumfonto %1.

# @title:window
source: Field Type
eo: Kampo-Tipo

# @info
source: The data type for field <resource>%1</resource> could not be determined. Please select one of the following data types.
eo: La datumtipo por kampo <resource>%1</resource> ne povis esti determinita. Bonvolu elekti unu el la sekvaj datumtipoj.

source: Could not find any migration database drivers.
eo: Ne eblis trovi iujn ajn migradatumbazajn pelilojn.

source: [Can't assign to this widget]
eo: [Ne povas atribui al ĉi tiu fenestraĵo]

source: [Can't assign to multiple widgets]
eo: [Ne povas atribui al pluraj fenestraĵoj]

# @label Form data source - title
source: Data source
eo: Fonto de datumoj

source: Go to selected form's data source
eo: Iri al la datumfonto de elektita formo

source: Goes to selected form's data source
eo: Iras al la datumfonto de elektita formo

# @label Forms's data source (table or query)
source: Form
eo: Formo

# @label Widget's data source (table field or query field)
source: Widget
eo: Fenestraĵo

source: Data Source
eo: Fonto de datumoj

source: Frame Color
eo: Kadra Koloro

source: Pointer
eo: Montrilo

source: Snap to Grid
eo: Vicigi al Krado

source: Style
eo: Stilo

source: Set the current view style.
eo: Agordi la aktualan vidostilon.

source: Show Form UI Code
eo: Montri Formularan UI-Kodon

source: Set form's data source to <resource>%1</resource>
eo: Agordi la datumfonton de formularo al <resource>%1</resource>

# @title:window
source: Form's UI Code
eo: UI-Kodo de Formo

source: Current
eo: Aktuala

source: Original
eo: Originala

source: form
eo: formo

# tooltip
source: Create new form
eo: Krei novan formon

# what's this
source: Creates new form.
eo: Kreas novan formon.

source: Clear Widget Contents
eo: Klara Enhavo de la Fenestraĵo

source: Edit Tab Order...
eo: Redakti Tab Ordon...

source: Bring Widget to Front
eo: Alporti Fenestraĵon al la Fronto

source: Send Widget to Back
eo: Sendi Fenestraĵon al Malantaŭo

source: Align Widgets Position
eo: Vicigi Pozicion de Fenestraĵoj

source: To Left
eo: Al Maldekstro

source: To Right
eo: Al Dekstro

source: To Top
eo: Al Supro

source: To Bottom
eo: Al Malsupro

source: To Grid
eo: Al Krado

source: Adjust Widgets Size
eo: Alĝustigi Grandecon de Fenestraĵoj

source: To Fit
eo: Por Konveni

source: To Shortest
eo: Al Plej Mallonga

source: To Tallest
eo: Al Plej Alta

source: To Narrowest
eo: Al Plej Mallarĝa

source: To Widest
eo: Al Plej Larĝa

# @info
source: Design of form <resource>%1</resource> has been modified.
eo: Dezajno de formo <resource>%1</resource> estas modifita.

# @info
source: Form <resource>%1</resource> already exists.
eo: Formo <resource>%1</resource> jam ekzistas.

source: Data source
eo: Fonto de datumoj

# @info
source: Form <resource>%1</resource>
eo: Formo <resource>%1</resource>

source: Click to show actions for this image box
eo: Klaki por montri agojn por ĉi tiu bildkesto

source: Click to show actions for <interface>%1</interface> image box
eo: Klaku por montri agojn por <interface>%1</interface> bildkesto

# Unbound Image Box
source: %1 (unbound)
eo: %1 (neligita)

# Unbound Image Box
source: %1 (unbound)
eo: %1 (neligita)

# Form widget
source: Form
eo: Formo

source: A form widget
eo: Forma fenestraĵo

# Text Box widget
source: Text Box
eo: Tekstujo

source: textBox
eo: tekstuj

source: A widget for entering and displaying line of text text
eo: Fenestraĵo por enigi kaj montri linion de teksta teksto

# Text Editor widget
source: Text Editor
eo: Teksta redaktilo

source: textEditor
eo: tekstredaktil

source: A multiline text editor
eo: Plurlinia tekstredaktilo

# Text Label widget
source: Label
eo: Etikedo

source: label
eo: etikedo

source: A widget for displaying text
eo: Fenestraĵo por montri tekston

# Image Box widget
source: Image Box
eo: Bilda Skatolo

source: image
eo: bildo

source: A widget for displaying images
eo: Fenestraĵo por montri bildojn

# Combo Box widget
source: Combo Box
eo: Kombinskatolo

source: comboBox
eo: komboKesto

source: A combo box widget
eo: Kombokesto fenestraĵo

# Check Box widget
source: Check Box
eo: Markobutono

source: checkBox
eo: markobutono

source: A check box with text label
eo: Markobutono kun teksta etikedo

# Button widget
source: Button
eo: Butono

source: button
eo: butonon

source: A button for executing actions
eo: Butono por plenumi agojn

# Link Button widget
source: Link Button
eo: Ligo-Butono

source: linkButton
eo: ligiloButono

source: A Link button for executing actions
eo: Ligo-butono por plenumi agojn

# Slider widget
source: Slider
eo: Ŝovilo

source: slider
eo: glitilo

source: A Slider widget
eo: Slider-fenestraĵo

# Progress Bar widget
source: Progress Bar
eo: Progresa Trinkejo

source: progressBar
eo: progresBaro

source: A Progress Bar widget
eo: Fenestraĵo de Progressbaro

source: Line
eo: Linio

source: line
eo: linio

source: A line to be used as a separator
eo: Linio uzenda kiel apartigilo

source: Insert &Horizontal Line
eo: Enmeti &Horizontalan Linion

source: Insert &Vertical Line
eo: Enmeti &Vertikalan Linion

# Date Picker widget
source: Date Picker
eo: Dat-elektilo

source: datePicker
eo: datElektil

source: A Date Picker widget
eo: Dat-elektila Fenestraĵo

# Property: Echo mode for Line Edit widget eg. Normal, NoEcho, Password
source: Echo Mode
eo: Eĥa Reĝimo

source: Indent
eo: Deŝovo

source: Inverted
eo: Inversa

source: Minimum
eo: Minimumo

source: Maximum
eo: Maksimumo

source: Format
eo: Formato

source: Orientation
eo: Orientiĝo

source: Text Direction
eo: Teksta Direkto

source: Text Visible
eo: Teksto Videbla

source: Value
eo: Valoro

source: Date
eo: Dato

source: Arrow Visible
eo: Sago Videbla

source: Description
eo: Priskribo

# Property of slider widgets
source: Page Step
eo: Paĝa Paŝo

# Property of slider widgets
source: Single Step
eo: Ununura Paŝo

# Property of slider widgets
source: Tick Interval
eo: Mark-Intervalo

# Property of slider widgets
source: Tick Position
eo: Markpozicio

source: Show Editor
eo: Montri Redaktilon

source: Form Name
eo: Formulnomo

source: On Click
eo: Je Klako

source: On Click Option
eo: Je-Klaka Opcio

source: Auto Tab Order
eo: Aŭtomata Langet-Ordo

source: Spell Checking
eo: Literuma Kontrolo

source: Line Wrap At
eo: Liniofaldo Ĉe

source: Line Wrap Mode
eo: Linifalda Reĝimo

source: Spell Checking Language
eo: Literumkontrola Lingvo

source: Editor Type
eo: Redaktora Tipo

# AutoField editor's type
source: Multiline Text
eo: Plurlinia Teksto

# AutoField editor's type
source: Drop-Down List
eo: Fala Listo

# AutoField editor's type
source: Image
eo: Bildo

# Possible value of slider widget's "Tick position" property
source: No Ticks
eo: Neniuj Marketoj

# Possible value of slider widget's "Tick position" property
source: Above
eo: Supra

# Possible value of slider widget's "Tick position" property
source: Left
eo: Maldekstra

# Possible value of slider widget's "Tick position" property
source: Below
eo: Malsupra

# Possible value of slider widget's "Tick position" property
source: Right
eo: Dekstra

# Possible value of slider widget's "Tick position" property
source: Both Sides
eo: Ambaŭflanka

source: Size
eo: Grandeco

source: Image
eo: Bildo

source: Scaled Contents
eo: Skalita Enhavo

# Property: Smoothing when contents are scaled
source: Smoothing
eo: Glatigo

# Property: Keep Aspect Ratio (keep short)
source: Keep Ratio
eo: Konservi Proporcion

# Drop-Down Button for Image Box Visible (a property name, keep the text narrow!)
source: Drop-Down Button Visible
eo: Falbutono Videbla

# Property: Checked checkbox
source: Checked
eo: Markita

# Property: Tristate checkbox
source: Tristate
eo: Tristata

# Value of "Tristate" property in checkbox: default
source: Default
eo: Defaŭlta

# Value of "Tristate" property in checkbox: yes
source: Yes
eo: Jes

# Value of "Tristate" property in checkbox: no
source: No
eo: Ne

# Editable combobox
source: Editable
eo: Redaktebla

# Property: Button is checkable
source: On/Off
eo: Enŝaltita/Malŝaltita

# Property: Button
source: Auto Repeat
eo: Aŭtomata Ripeto

# Property: Auto Repeat Button's Delay
source: Auto Rep. Delay
eo: Prokrasto de Aŭtomata Rip.

# Property: Auto Repeat Button's Interval
source: Auto Rep. Interval
eo: Intervalo de Aŭtomata Rip.

# Property: Button is flat
source: Flat
eo: Plata

# Hyperlink address
source: Hyperlink
eo: Hiperligo

# Type of hyperlink
source: Hyperlink Type
eo: Hiperliga Tipo

# Tool used for opening a hyperlink
source: Hyperlink Tool
eo: Hiperliga Ilo

# Allow to open remote hyperlinks
source: Remote Hyperlink
eo: Fora Hiperligo

# Allow to open executables
source: Executable Hyperlink
eo: Efektivigebla Hiperligo

# Hyperlink type, NoHyperlink
source: No Hyperlink
eo: Neniu Hiperligo

# Hyperlink type, StaticHyperlink
source: Static
eo: Senmova

# Hyperlink type, DynamicHyperlink
source: Dynamic
eo: Dinamika

# Hyperlink tool, DefaultTool
source: Default
eo: Defaŭlta

# Hyperlink tool, BrowserTool
source: Browser
eo: Retumilo

# Hyperlink tool, MailerTool
source: Mailer
eo: Poŝtisto

source: Text Format
eo: Tekstformato

# For Text Format
source: Plain
eo: Simpla

# For Text Format
source: Hypertext
eo: Hiperteksto

# For Text Format
source: Auto
eo: Aŭtomata

# For Text Format
source: Log
eo: Protokolo

# property: Can open external links in label
source: Open Ext. Links
eo: Malfermi Ekst. Ligilojn

# Property: line edit's placeholder text
source: Placeholder Text
eo: Lokokupa Teksto

# Property: Clear Button Enabled
source: Clear Button
eo: Viŝbutono

# Property: Password Mode for line edit
source: Password Mode
eo: Pasvorta Reĝimo

# Property: Squeezed Text Mode for line edit
source: Squeezed Text
eo: Kunpremita Teksto

source: Tab Stop Width
eo: Tab-intervala Larĝo

source: Tab Changes Focus
eo: Fokuso de Tab-ŝanĝoj

source: Word Wrap Policy
eo: Politiko de Linifaldo

# Property: For Word Wrap Policy
source: At Word Boundary
eo: Ĉe Vortlimo

# Property: For Word Wrap Policy
source: Anywhere
eo: Ie ajn

# Property: For Word Wrap Policy
source: At Word Boundary If Possible
eo: Ĉe Vortlimo Se Eble

source: Word Wrapping
eo: Vortfaldado

source: Word Wrap Position
eo: Vortfalda Pozicio

# Property: For Word Wrap Position
source: None
eo: Neniu

# Property: For Word Wrap Position
source: Widget's Width
eo: Larĝo de Fenestraĵo

# Property: For Word Wrap Position
source: In Pixels
eo: En Rastrumeroj

# Property: For Word Wrap Position
source: In Columns
eo: En Kolumnoj

source: Links Underlined
eo: Ligiloj Substrekitaj

source: Horizontal Scroll Bar
eo: Horizontala Rulumbreto

source: Vertical Scroll Bar
eo: Vertikala Rulumbreto

# Property: Show Scroll Bar As Needed
source: As Needed
eo: Laŭ bezono

# Property: Scroll Bar Always Off
source: Always Off
eo: Ĉiam Malŝaltita

# Property: Scroll Bar Always On
source: Always On
eo: Ĉiam Ŝaltita

# Property: Text Edit accepts rich text
source: Rich Text
eo: Riĉa Teksto

source: Tab Widget
eo: Langeta Fenestraĵo

source: A widget to display multiple pages using tabs
eo: Fenestraĵo por montri plurajn paĝojn per langetoj

# Frame widget
source: Frame
eo: Framo

source: frame
eo: kadro

source: A frame widget
eo: Kadra fenestraĵo

source: Group Box
eo: Grupkesto

source: groupBox
eo: grupKest
