Repository: KDE/kexi
Catalog: po/*/kexi.po
Languages: eo

source: Setting Autonumber Field
eo: Agordo de Aŭtonumera Kampo

# @action:button
source: Create &Primary Key
eo: Krei &Primaran Ŝlosilon

# (qtundo-format)
source: Set autonumber for field <resource>%1</resource>
eo: Agordi aŭtomatan numeron por kampo <resource>%1</resource>

# (qtundo-format)
source: Delete autonumber from field <resource>%1</resource>
eo: Forigi aŭtomatan numeron el kampo <resource>%1</resource>

# (qtundo-format)
source: Set <resource>%1</resource> property for field <resource>%2</resource>
eo: Agordi <resource>%1</resource> trajton por kampo <resource>%2</resource>

# (qtundo-format)
source: Change type for field <resource>%1</resource> to <resource>%2</resource>
eo: Ŝanĝi tipon por kampo <resource>%1</resource> al <resource>%2</resource>

# (qtundo-format)
source: Set primary key for field <resource>%1</resource>
eo: Agordi ĉefan ŝlosilon por kampo <resource>%1</resource>

# (qtundo-format)
source: Unset primary key for field <resource>%1</resource>
eo: Malŝalti ĉefŝlosilon por kampo <resource>%1</resource>

source: You should enter field caption.
eo: Vi devus enigi kampotekston.

source: You have added no fields. Every table should have at least one field.
eo: Vi aldonis neniujn kampojn. Ĉiu tabelo havu almenaŭ unu kampon.

# @info
source: <para>You have added <resource>%1</resource> field name twice.</para><para>Field names cannot be repeated. Correct name of the field.</para>
eo: <para >Vi aldonis <resource>%1</resource> kampan nomon dufoje.</para><para >Kamponomoj ne povas esti ripetitaj. Ĝusta nomo de la kampo.</para>

# @info
source: Table <resource>%1</resource> has no primary key defined.<para><note>Although a primary key is not required, it is needed for creating relations between database tables. Do you want a primary key to be automatically added now?</note></para><para>If you want to add a primary key by hand, press <interface>Cancel</interface> to cancel saving table design.</para>
eo: Tabelo <resource>%1</resource> havas neniun ĉefan ŝlosilon difinita.<para><note>Kvankam ĉefa ŝlosilo ne estas bezonata, ĝi estas bezonata por krei rilatojn inter datumbazaj tabeloj. Ĉu vi volas ke ĉefa ŝlosilo estu aŭtomate aldonita nun?</note></para><para>Se vi volas aldoni ĉefan ŝlosilon mane, premu <interface>Nuligi</interface> por nuligi konservadon de tabeldezajno.</para>

# @info
source: <para>You are about to change the design of table <resource>%1</resource> but following objects using this table are open:</para>
eo: <para>Vi estas ŝanĝonta la dezajnon de tabelo <resource>%1</resource> sed sekvaj objektoj uzantaj ĉi tiun tabelon estas malfermitaj:</para>

# @info
source: Table field <resource>%1</resource>
eo: Tabelkampo <resource>%1</resource>

# Empty table row
source: Empty Row
eo: Malplena Vico

# @info
source: <para>Do you want to save the design now?</para>%1
eo: <para>Ĉu vi volas konservi la dezajnon nun?</para>%1

source: table
eo: tabelo

# tooltip
source: Create new table
eo: Krei novan tabelon

# what's this
source: Creates new table.
eo: Kreas novan tabelon.

# @info
source: <para>You are about to delete table <resource>%1</resource> but it is used by following opened windows:</para>
eo: <para>Vi estas forigonta tabelon <resource>%1</resource> sed ĝi estas uzata per sekvaj malfermitaj fenestroj:</para>

# @info
source: <para>You are about to rename table <resource>%1</resource> but it is used by following opened windows:</para>
eo: <para>Vi estas renomonta tabelo <resource>%1</resource> sed ĝi estas uzata per sekvaj malfermitaj fenestroj:</para>

# @info
source: Design of table <resource>%1</resource> has been modified.
eo: Dezajno de tabelo <resource>%1</resource> estas modifita.

# @info
source: Table <resource>%1</resource> already exists.
eo: Tabelo <resource>%1</resource> jam ekzistas.

# @info
source: <warning>Any data in this table will be deleted upon design's saving!</warning>
eo: <warning>Ajnaj datumoj en ĉi tiu tabelo estos forigita post konservado de dezajno!</warning>

source: Lookup column
eo: Serĉa kolumno

# @info
source: Table <resource>%1</resource>
eo: Tabelo <resource>%1</resource>

# Question
source: Error: %1?
eo: Eraro: %1?

source: The column's constraint is declared as NOT NULL (required).
eo: La limo de la kolumno estas deklarita kiel NOT NULL (postulata).

source: The column's constraint is declared as NOT EMPTY (text should be filled).
eo: La limo de la kolumno estas deklarita kiel NE MALIKA (teksto devas esti plenigita).

source: The column's constraint is declared as NOT EMPTY and NOT NULL.
eo: La limo de la kolumno estas deklarita kiel NE MALKA kaj NE NULA.

source: Do you want to delete selected record?
eo: Ĉu vi volas forigi elektitan rikordon?

# @action:button
source: &Delete Record
eo: &Forigi Rikordon

source: Do you want to clear the contents of table %1?
eo: Ĉu vi volas forigi la enhavon de tabelo %1?

# @action:button
source: &Clear Contents
eo: &Malplenigi Enhavon

source: Record: %1
eo: Rikordo: %1

# @action:button Correct Changes
source: Correct
eo: Korekti

source: Correct changes
eo: Korekti ŝanĝojn

# @action:button
source: Discard Changes
eo: Forĵeti ŝanĝojn

source: NAME
eo: NOMO

source: Field Name
eo: Kampa Nomo

source: * (All Columns)
eo: * (Ĉiuj Kolumnoj)

# Text encoding: Default
source: Default: %1
eo: Defaŭlta: %1

source: <title>Select Existing Database Server's Connection From the List Below</title> <para>You will see existing KEXI projects available for the selected connection. Here you may also add, edit or delete connections from the list.</para>
eo: <title>Elektu la Konekton de Ekzistanta Datumbaza Servilo El la Suba Listo</title> <para>Vi vidos ekzistantajn KEXI-projektojn disponeblaj por la elektita konekto. Ĉi tie vi ankaŭ povas aldoni, redakti aŭ forigi konektojn el la listo.</para>

source: Server Information
eo: Servila informo

source: &Add...
eo: &Aldoni...

source: &Edit...
eo: R&edakti...

source: &Delete...
eo: &Forigi...

source: Add a new database connection
eo: Aldoni novan datumbazan konekton

source: Edit selected database connection
eo: Redakti elektitan datumbazan konekton

source: Delete selected database connections
eo: Forigi elektitajn datumbazajn konektojn

source: File
eo: Dosiero

# @action:button Add Database Connection
source: &Add
eo: &Aldoni

source: Add database connection
eo: Aldoni datumbazan konekton

# @title:window
source: Add a New Database Connection
eo: Aldoni Novan Datumbazan Konekton

# @action:button Save Database Connection
source: &Save
eo: Kon&servi

source: Save changes made to this database connection
eo: Konservi ŝanĝojn faritajn al ĉi tiu datumbaza konekto

# @title:window
source: Edit Database Connection
eo: Redakti datumbazan konekton

# @info
source: Do you want to delete database connection <resource>%1</resource> from the list of available connections?
eo: Ĉu vi volas forigi datumbazan konekton <resource>%1</resource> el la listo de disponeblaj konektoj?

source: Define Query...
eo: Difini Demandon...

source: Pro&ject caption:
eo: Subtitolo de la pro&jekto:

source: Project file&name:
eo: Projektdosiero&nomo:

source: Load database list from the server
eo: Ŝarĝi datumbazan liston de la servilo

source: Loads database list from the server, so you can select one using the <interface>Name</interface> combo box.
eo: Ŝarĝas datumbazan liston el la servilo, do vi povas elekti unu per la kombinujo <interface>Nomo</interface>.

# @action:button
source: Save Changes
eo: Konservi Ŝanĝojn

source: Save all changes made to this connection information
eo: Konservi ĉiujn ŝanĝojn faritajn al ĉi tiu koneksa informo

source: Save all changes made to this connection information. You can later reuse this information.
eo: Konservu ĉiujn ŝanĝojn faritajn al ĉi tiu koneksa informo. Vi povas poste reuzi ĉi tiun informon.

# @action:button
source: &Test Connection
eo: &Testi Konekton

source: Test database connection
eo: Testi datumbazan konekton

source: Tests database connection. You can check validity of connection information.
eo: Testas datumbazan konekton. Vi povas kontroli validecon de informoj pri konekto.

source: Database Connection
eo: Datumbaza Konekto

source: Database
eo: Datumbazo

source: Parameters
eo: Parametroj

source: Details
eo: Detaloj

# @title:window
source: Open Database
eo: Malfermu datumbazon

# @title:window
source: Connect to a Database Server
eo: Konekti al datumbaza servilo

# @action:button
source: &Open
eo: &Malfermi

source: Open Database Connection
eo: Malferma Datumbaza Konekto

source: Authentication
eo: Aŭtentigo

source: &Username:
eo: &Uzantonomo:

source: &Password:
eo: &Pasvorto:

source: <html><head/><body><p>Saves password in a <span style=" font-style:italic;">.kexic</span> or <span style=" font-style:italic;">.kexis</span> connection shortcut file using a simple encryption similar to ROT-47. It does not guarantee security, but simply makes it difficult for anyone to read, so generally it is not safe to make such files publicly accessible.</p></body></html>
eo: <html><head/><body><p>Konservas pasvorton en <span style=" font-style:italic;">.kexic</span> aŭ <span style=" font-style:italic; ;">.kexis</span> koneksa ŝparvoja dosiero uzante simplan ĉifradon similan al ROT-47. Ĝi ne garantias sekurecon, sed simple malfaciligas al iu ajn legi, do ĝenerale ne estas sekure fari tiajn dosierojn publike alireblaj.</p></body></html>

source: Save password
eo: Konservi pasvorton

source: &Name:
eo: &Nomo:

source: &Caption (optional):
eo: &Subtitolo (laŭvola):

source: Database Server
eo: Datumbaza Servilo

source: &Engine:
eo: &Motoro:

source: Local server
eo: Loka servilo

source: Remote server
eo: Fora servilo

source: &Hostname:
eo: &Komputilnomo:

source: Port:
eo: Pordo:

# port: default
source: Default
eo: Defaŭlta

source: Use socket &file instead of TCP/IP port:
eo: Uzi konektingan &dosieron anstataŭ TCP/IP-haveno:

# socket: default
source: Default
eo: Defaŭlta

source: &Description:
eo: &Priskribo:

# @title:window
source: Opening Database
eo: Malferma Datumbazo

# @info
source: Supply a password below.
eo: Provizu pasvorton sube.

source: &Details >>
eo: &Detaloj >>

source: Database server:
eo: Datumbaza servilo:

# unspecified user
source: (unspecified)
eo: (nespecifita)

source: &Open
eo: &Malfermi

source: All supported formats
eo: Ĉiuj subtenataj formatoj

source: Computer
eo: Komputilo

source: Could not enter directory <filename>%1</filename>.
eo: Ne eblis enigi dosierujon <filename>%1</filename>.

source: Go to parent directory
eo: Iri al gepatra dosierujo

source: Select directory
eo: Elekti dosierujon

source: Name:
eo: Nomo:

source: Filter:
eo: Filtrilo:

source: Enter a filename.
eo: Enigu dosiernomon.

# @info
source: The file <filename>%1</filename> does not exist.
eo: La dosiero <filename>%1</filename> ne ekzistas.

# @info
source: Enter a filename.
eo: Enigu dosiernomon.

# @info
source: The file <filename>%1</filename> is not readable.
eo: La dosiero <filename>%1</filename> ne estas legebla.

source: Do you want to replace it?
eo: Ĉu vi volas anstataŭigi ĝin?

source: Replace object
eo: Anstataŭigi objekton

# @action:button
source: &Choose Other Name...
eo: &Elekti Alian Nomon...

source: Caption:
eo: Titolo:

source: Please enter the name.
eo: Bonvolu enigi la nomon.

source: Please enter the caption.
eo: Bonvolu enigi la bildotekston.

source: Supply a password below.
eo: Provizu pasvorton sube.

source: Username:
eo: Uzantnomo:

source: Anonymous:
eo: Anonima:

source: Database name:
eo: Datumbaza nomo:

source: Password:
eo: Pasvorto:

source: Remember password:
eo: Memoru pasvorton:

source: Projects stored in a file
eo: Projektoj konservitaj en dosiero

source: Projects stored on a database server
eo: Projektoj stokitaj sur datumbaza servilo

source: <b>There are KEXI projects you have recently opened.</b> Select one you wish to open:
eo: <b>Estas KEXI-projektoj, kiujn vi lastatempe malfermis.</b> Elektu tiun, kiun vi volas malfermi:

source: Project Name
eo: Nomo de Projekto

source: Connection
eo: Konekto

source: File (%1)
eo: Dosiero (%1)

source: Select a project on <resource>%1</resource> database server to open:
eo: Elektu projekton sur <resource>%1</resource> datumbaza servilo por malfermi:

# @title:window Enter Query Parameter Value
source: Enter Parameter Value
eo: Enigi Parametran Valoron

# Boolean False - No
source: No
eo: Ne

# Boolean True - Yes
source: Yes
eo: Jes

# @info
source: <title>No database server drivers found</title><para>Connection to a database server requires an appropriate driver which you do not have installed.</para><subtitle>Details</subtitle><para>To obtain database drivers please use your Package Manager to search and install packages with so-called <emphasis>KDb drivers</emphasis> named <filename>kdb-****-driver</filename>. Please note that your package names could vary slightly depending on the operating system you use.</para>
eo: <title>Neniu datumbaza servilo ŝoforoj trovitaj</title><para>Konekto al datumbaza servilo postulas taŭgan pelilon, kiun vi ne havas instalitan.</para><subtitle>Detaloj</subtitle><para>Por akiri datumbazajn ŝoforojn bonvolu uzi vian Pakaĵadministrilon por serĉi kaj instali pakaĵojn kun tiel nomataj <emphasis>KDb-peliloj</emphasis> nomitaj <filename>kdb-****-driver</filename>. Bonvolu noti, ke viaj pakaĵnomoj povus iomete varii depende de la operaciumo kiun vi uzas.</para>

source: This file already exists. Do you want to overwrite it?
eo: Ĉi tiu dosiero jam ekzistas. Ĉu vi volas anstataŭigi ĝin?

source: Overwrite
eo: Anstataŭigi

# @title:window
source: Project Navigator
eo: Projekta Navigilo

source: Open object
eo: Malferma objekto

source: Opens object selected in the list.
eo: Malfermas objekton elektitan en la listo.

source: Delete object
eo: Forigi objekton

source: Deletes the object selected in the list.
eo: Forigas la objekton elektitan en la listo.

source: &Rename...
eo: &Alinomi...

source: Rename object
eo: Alinomi objekton

source: Renames the object selected in the list.
eo: Renomas la objekton elektitan en la listo.

source: &Design
eo: &Dezajno

source: Design object
eo: Dezajnobjekto

source: Starts designing of the object selected in the list.
eo: Komencas desegnadon de la objekto elektita en la listo.

source: Design object in text view
eo: Dezajnobjekto en tekstvido

source: Starts designing of the object in the list in text view.
eo: Komencas desegnadon de la objekto en la listo en tekstvido.

# Export->To Clipboard as Data...
source: To &Clipboard...
eo: Al &Tondujo...

source: Export data to clipboard
eo: Eksporti datumojn al tondujo

source: Exports data from the currently selected table or query to clipboard.
eo: Eksportas datumojn de la nuntempe elektita tabelo aŭ demando al tondujo.

# Export->To File As Data &Table...
source: To &File As Data Table...
eo: Al &Dosiero Kiel Datuma Tabelo...

source: Export data to a file
eo: Eksporti datumojn al dosiero

source: Exports data from the currently selected table or query to a file.
eo: Eksportas datumojn de la nuntempe elektita tabelo aŭ demando al dosiero.

source: &Create Object: %1...
eo: &Krei Objekton: %1...

source: &Create Object...
eo: &Krei Objekton...

# @info Rename object %1:
source: Rename <resource>%1</resource>:
eo: Alinomi <resource>%1</resource>:

# @action:button Rename object
source: Rename
eo: Renomi

# @title:window Rename Object %1.
source: Rename <resource>%1</resource>
eo: Alinomi <resource>%1</resource>

# @info Message for empty state in project navigator
source: <nl/><nl/><img src="%1" width="48"/><nl/>Your project is empty...<nl/>Why not <b>create</b> something?
eo: <nl/><nl/><img src="%1" width="48"/><nl/>Via projekto estas malplena...<nl/>Kial ne <b>krei</b> ion?

source: No field selected
eo: Neniu kampo elektita

source: No object selected
eo: Neniu objekto elektita

source: &Hide Selected Table/Query
eo: &Kaŝi Elektitan Tabelon/Demandon

source: &Delete Selected Relationship
eo: &Forigi Elektitan Rilaton

source: &Open Selected Table/Query
eo: &Malfermi Elektitan Tabelon/Demandon

source: Table:
eo: Tabelo:

# Insert table/query into relations view
source: &Insert
eo: Enmet&i

source: &Hide Table
eo: &Kaŝi Tabelon

source: &Append Field
eo: &Aldoni Kampon

source: &Append Fields
eo: &Aldoni Kampojn

source: &Open Table
eo: &Malfermi Tabelon

source: &Design Table
eo: &Dezajna Tabelo

source: Relationship
eo: Rilato

source: Click to show available actions for this cell
eo: Klaku por montri disponeblajn agojn por ĉi tiu ĉelo

# @info:whatsthis
source: Contains a pointer to the currently selected record.
eo: Enhavas montrilon al la nuntempe elektita rikordo.

# @info:whatsthis
source: Record navigator.
eo: Rikorda navigilo.

# @info:whatsthis
source: Column <resource>%1</resource>.
eo: Kolumno <resource>%1</resource>.

# Default text for undo action
source: Undo
eo: Malfari

source: Undo %1
eo: Malfari %1

# Default text for redo action
source: Redo
eo: Refari

source: Redo %1
eo: Refari %1

source: <empty>
eo: <malplena>

source: Redo
eo: Refari

source: Undo
eo: Malfari

source: Insert From &File...
eo: Enigi el &Dosiero...

source: &Clear
eo: &Forigi

source: Properties
eo: Trajtoj

# @title
source: Insert Image From File
eo: Enigi Bildon El Dosiero

# @title
source: Save Image to File
eo: Konservi Bildon al Dosiero

# @info
source: <para>File <filename>%1</filename> already exists.</para><para>Do you want to replace it with a new one?</para>
eo: <para >Dosiero <filename>%1</filename> jam ekzistas.</para><para >Ĉu vi volas anstataŭigi ĝin per nova?</para>

# @action:button
source: &Replace
eo: &Anstataŭigi

source: &Don't Replace
eo: &Ne Anstataŭigi

# Autonumber, make it as short as possible
source: (auto)
eo: (aŭtomate)

source: Record:
eo: Rikordo:

source: Current record number
eo: Nuna rikorda nombro

# "of" in record number information: N of M
source: of
eo: el

source: Number of records
eo: Nombro de rikordoj

source: Editing indicator
eo: Redakta indikilo

source: First record
eo: Unua disko

source: Go to first record
eo: Iri al la unua disko

source: Go to previous record
eo: Iru al antaŭa rikordo

source: Previous record
eo: Antaŭa rikordo

source: Go to next record
eo: Iri al la sekva rikordo

source: Next record
eo: Sekva rikordo

source: Go to last record
eo: Iri al lasta rikordo

source: Last record
eo: Lasta rikordo

source: Go to new record
eo: Iri al nova rikordo

source: New record
eo: Nova rikordo

source: Moves cursor to first record.
eo: Movas kursoron al la unua registro.

source: Moves cursor to previous record.
eo: Movas kursoron al antaŭa rikordo.

source: Moves cursor to next record.
eo: Movas kursoron al sekva registro.

source: Moves cursor to last record.
eo: Movas kursoron al lasta rikordo.

source: Moves cursor to new record and allows inserting.
eo: Movas kursoron al nova registro kaj permesas enmeti.
