Repository: KDE/kexi
Catalog: po/*/kexi.po
Languages: eo

source: &No View
eo: &Neniu Vido

source: &Data View
eo: &Data Vido

source: D&esign View
eo: D&ezajna Vido

source: &Text View
eo: &Teksta Vido

source: &Unknown
eo: &Nekonata

source: This function is not available for version %1 of %2 application.
eo: Ĉi tiu funkcio ne disponeblas por versio %1 de aplikaĵo %2.

# @info
source: <resource>%1</resource> function is not available for version %2 of %3 application.
eo: <resource>%1</resource> funkcio ne disponeblas por versio %2 de aplikaĵo %3.

# @info
source: <application>%1</application> could have been incorrectly installed or started. The application will be closed.
eo: <application>%1</application> povus esti malĝuste instalita aŭ lanĉita. La aplikaĵo estos fermata.

source: Visual database applications creator
eo: Kreilo por vidaj datumbaz-aplikaĵoj

source: © 2002-%1, The KEXI Team
eo: © 2002-%1, La KEXI-Teamo

source: This software is developed by KEXI Team - an international group of independent developers. They form a part of the Calligra Project.
eo: Ĉi tiu programaro estas evoluigita de KEXI Team - internacia grupo de sendependaj programistoj. Ili formas parton de la Calligra-projekto.

source: Project maintainer & developer, overall design
eo: Projekta prizorganto kaj programisto, ĝenerala dezajno

source: Sponsoring and support (employer of Jarosław Staniek in 2003-2007)
eo: Sponsorado kaj subteno (dunganto de Jarosław Staniek en 2003-2007)

source: PostgreSQL database driver, Migration and Reporting modules, numerous bug fixes
eo: PostgreSQL-datumbaza pelilo, Migrado kaj Raportado-moduloj, multaj eraroj

source: Map elements for forms and reports, map flake shape
eo: Mapelementoj por formoj kaj raportoj, mapo-flakformo

source: Features and bug fixes
eo: Trajtoj kaj korektoj de cimoj

source: Roman Shtemberko
eo: Roman Ŝtemberko

source: Users Manual for KEXI 2, main window improvements, numerous bug reports
eo: Manlibro por Uzantoj por KEXI 2, ĉefaj fenestraj plibonigoj, multaj cimraportoj

source: Oleg Kukharchuk
eo: Oleg Kuĥarĉuk

source: Several form widgets, porting to Qt 4, stabilization
eo: Pluraj formaj fenestraĵoj, pordo al Qt 4, stabiligo

source: Web elements for forms and reports
eo: TTT-elementoj por formoj kaj raportoj

source: Scripting module (KROSS), Python language bindings, design
eo: Skriptomodulo (KROSS), Python-lingvaj ligoj, dezajno

source: Web Forms module
eo: Modulo Web Forms

source: Sybase/MS SQL Server/ODBC database drivers, xBase migration plugin, improvements for KexiDB
eo: Sybase/MS SQL Server/ODBC datumbazŝoforoj, xBase-migrada kromaĵo, plibonigoj por KexiDB

source: First version of Property Editor and Form Designer
eo: Unua versio de Property Editor kaj Form Designer

source: Contributions for MySQL and KexiDB, fixes, Migration module, MS Access file format support
eo: Kontribuoj por MySQL kaj KexiDB, korektoj, Migrado-modulo, MS Access-dosierformato-subteno

source: Oracle database driver
eo: Oracle datumbaza pelilo

source: Graphics effects, helper dialogs
eo: Grafikaj efikoj, helpaj dialogoj

source: ODBC database driver
eo: ODBC datumbaza pelilo

source: Former project maintainer & developer
eo: Iama projekt-prizorgisto kaj programisto

source: Former developer
eo: Iama programisto

source: Original Form Designer, original user interface & much more
eo: Originala Form Designer, originala uzantinterfaco kaj multe pli

source: CQL++, SQL assistance
eo: CQL++, SQL-helpo

source: Original code cleanings
eo: Originalaj kodaj purigadoj

source: Bugfixes, original Table Widget
eo: Cimkorektoj, originala Table Widget

source: Numerous bug reports and tests
eo: Multaj cimraportoj kaj testoj

source: AppImage packages for Linux
eo: AppImage-pakaĵoj por Linukso

source: Ian Balchin
eo: Ian Balĉin

source: Numerous bug reports and tests, handbook improvements
eo: Multaj cimraportoj kaj testoj, manlibro-plibonigoj

source: Bug fixes, build system improvements, code cleanups
eo: Cimoj korektoj, konstruaj sistemaj plibonigoj, kodaj purigadoj

source: Code cleanups
eo: Kodpurigadoj

source: Initial design improvements
eo: Komencaj dezajnaj plibonigoj

source: Icons and user interface research
eo: Esplorado pri piktogramoj kaj uzantinterfaco

source: Coffee sponsoring
eo: Kafo sponsorado

source: Numerous bug reports, usability tests, technical support
eo: Multaj cimraportoj, uzeblotestoj, teknika subteno

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau,Oliver Kellogg

# 'createdb' command line option
source: Create a new, blank project using specified database driver and database name and exit immediately. You will be asked for confirmation if overwriting is needed.
eo: Kreu novan, malplenan projekton uzante specifitan datumbazan pelilon kaj datumbazan nomon kaj eliru tuj. Oni petos vin pri konfirmo, se oni bezonas anstataŭi.

# 'create-opendb' command line option
source: Like --createdb, but also open newly created database.
eo: Kiel --createdb, sed ankaŭ malfermu novkreitan datumbazon.

# 'dropdb' command line option
source: Drop (remove) a project using specified database driver and database name. You will be asked for confirmation.
eo: Forigu (forigu) projekton per specifita datumbaza pelilo kaj datumbaza nomo. Oni petos vin pri konfirmo.

# 'dbdriver' command line option
source: Name of a database driver to be used when connecting to a database project ("sqlite" by default). Ignored if a shortcut filename is provided. Complete KDb-specific globally unique identifier can be used, e.g. "org.kde.kdb.sqlite" to specify exact vendor of the driver.
eo: Nomo de datumbaza pelilo uzota dum konekto al datumbaza projekto ("sqlite" defaŭlte). Ignorita se ŝparvoja dosiernomo estas provizita. Kompleta KDb-specifa tutmonde unika identigilo povas esti uzata, ekz. "org.kde.kdb.sqlite" por specifi ĝustan vendiston de la pelilo.

# 'type' command line option
source: Specify the type of file provided as an argument. This option is only useful if the filename does not have a valid extension set and its type cannot be determined unambiguously by examining its contents. This option is ignored if no file is specified as an argument. Available file types are: - "project" for a project file (the default) - "shortcut" for a shortcut file pointing to a project. - "connection" for database connection data.
eo: Indiku la tipon de dosiero provizita kiel argumento. Ĉi tiu opcio estas nur utila se la dosiernomo ne havas validan etendaĵon kaj ĝian tipon ne povas esti senambigue determinita ekzamenante ĝian enhavon. Ĉi tiu opcio estas ignorita se neniu dosiero estas specifita kiel argumento. Disponeblaj dosiertipoj estas: - "projekto" por projektdosiero (la defaŭlta) - "mallongigo" por ŝparvoja dosiero indikanta al projekto. - "konekto" por datumbazaj konektodatenoj.

# 'connection' command line option
source: Specify a database connection shortcut .kexic file containing connection data. Can be used with --createdb or --create-opendb for convenience instead of using options such as --user, --host or --port. Note: Options like --user, --host have precedence over settings defined in the shortcut file.
eo: Specifu datumbazan konekt-ŝparvojan .kexic-dosieron enhavanta konektajn datumojn. Uzeblas kun --createdb aŭ --create-opendb por oportuno anstataŭ uzi opciojn kiel --user, --host aŭ --port. Noto: Opcioj kiel --user, --host havas prioritaton super agordoj difinitaj en la ŝparvoja dosiero.

# 'readonly' command line option
source: Specify that any database connections will be performed without write support. This option is ignored when "createdb" option is present, otherwise the database could not be created.
eo: Specifu, ke iuj datumbazaj konektoj estos faritaj sen skribsubteno. Ĉi tiu opcio estas ignorita kiam opcio "createdb" ĉeestas, alie la datumbazo ne povus esti kreita.

# 'user-mode' command line option
source: Start project in User Mode, regardless of the project settings.
eo: Komenci projekton en Uzanta Reĝimo, sendepende de la projektaj agordoj.

# 'design-mode' command line option
source: Start project in Design Mode, regardless of the project settings.
eo: Komencu projekton en Dezajna Reĝimo, sendepende de la projektaj agordoj.

# 'show-navigator' command line option
source: Show the Project Navigator side pane even if KEXI runs in User Mode.
eo: Montri la flankan panelon de Project Navigator eĉ se KEXI funkcias en Uzula Reĝimo.

# 'hide-menu' command line option
source: Hide the main menu (the tabbed toolbar) completely. A number of commands from the main menu is still visible. This option is useful in User Mode.
eo: Kaŝi la ĉefan menuon (la klapeta ilobreto) tute. Kelkaj komandoj de la ĉefa menuo ankoraŭ estas videblaj. Ĉi tiu opcio estas utila en Uzanta Reĝimo.

# 'open' command line option
source: Open object of type 'object_type' and name 'object_name' from specified project on application start. 'object_type' is optional, if omitted - %1 type is assumed. Other object types can be %2, %3, %4, %5. There may by more or less types available depending on KEXI plugins installed. Use "" characters to specify names containing spaces. Examples: --open MyTable, --open %2:"My very big query"
eo: Malfermi objekton de tipo 'object_type' kaj nomo 'object_name' de specifita projekto ĉe komenco de la aplikaĵo. 'object_type' estas nedeviga; se ellasita - tipo %1 estas supozata. Aliaj objektospecoj povas esti %2, %3, %4, %5. Povas pli-malpli da tipoj disponeblaj depende de KEXI-aldonaĵoj instalitaj. Uzu "" signojn por specifi nomojn enhavantajn spacojn. Ekzemploj: --open MiaTabelo, --open %2:"Mia tre granda informpeto"

# 'design' command line option
source: Like --open, but the object will be opened in Design Mode, if one is available.
eo: Kiel --open, sed la objekto estos malfermita en Dezajna Reĝimo, se unu disponeblas.

# 'edittext' command line option
source: Like --open, but the object will be opened in Text Mode, if one is available.
eo: Kiel --open, sed la objekto estos malfermita en Teksta Reĝimo, se unu disponeblas.

# 'execute' command line option
source: Start execution of object of type 'object_type' and name 'object_name' on application start. 'object_type' is optional, if omitted - %1 type is assumed. Object type can be also %2. There may by more or less types available depending on KEXI plugins installed. Use "" characters to specify names containing spaces.
eo: Komenci ruladon de objekto de tipo 'object_type' kaj nomo 'object_name' je lanĉo de la aplikaĵo. 'object_type' estas nedeviga, se ellasita - tipo %1 estas supozata. Objekta tipo ankaŭ povas esti %2. Povas esti pli aŭ malpli da tipoj disponeblaj depende de instalitaj kromaĵoj de KEXI. Uzu "" signojn por specifi nomojn enhavantajn spacojn.

# 'new' command line option
source: Start design of a new object of type 'object_type'.
eo: Komenci dezajnon de nova objekto de tipo 'object_type'.

# 'print' command line option
source: Open the Print dialog window for an object of type 'object_type' and name 'object_name' in the specified project when the application starts for quick printing of the object's data. 'object_type' is optional; if omitted, %1 type is assumed. Object type can also be %2.
eo: Malfermi la Presi dialogfenestron por objekto de tipo 'object_type' kaj nomo 'object_name' en la specifita projekto kiam la aplikaĵo komenciĝas por rapida presado de la datumoj de la objekto. 'objekto_tipo' estas nedeviga; se ellasita, %1 tipo estas supozita. Objekta tipo ankaŭ povas esti %2.

# 'print-preview' command line option
source: Open the Print Preview window for an object of type 'object_type' and name 'object_name' in the specified project when the application starts to see preview of the object's data printout. 'object_type' is optional; if omitted, %1 type is assumed. Object type can also be %2.
eo: Malfermi la fenestron de Presa Antaŭrigardo por objekto de tipo 'object_type' kaj nomu 'object_name' en la specifita projekto kiam la aplikaĵo startas por vidi antaŭrigardon de la datumprintaĵo de la objekto. 'object_type' estas nedeviga; se ellasita, %1 tipo estas supozita. Objekta tipo ankaŭ povas esti %2.

# 'user' command line option
source: Database server's user name when connecting to a project. Ignored if the project is opened using a shortcut file. Default user name is the same as the current login (<resource>%1</resource>).
eo: La uzantnomo de datumbaza servilo dum konekto al projekto. Ignorita se la projekto estas malfermita per ŝparvoja dosiero. Defaŭlta uzantnomo estas la sama kiel la nuna ensaluto (<resource>%1</resource>).

# 'host' command line option
source: Network server's (host) name to be used when connecting to a database project. Ignored if the project is opened using a shortcut file. Default host is the local computer.
eo: Reta servilo (gastiganto) nomo por esti uzata dum konekto al datumbaza projekto. Ignorita se la projekto estas malfermita per ŝparvoja dosiero. Defaŭlta gastiganto estas la loka komputilo.

# 'port' command line option
source: Network server's port number to be used when connecting to a database project. Ignored if the project is opened using a shortcut file. Defaults depend on the used server type (e.g. %1, %2).
eo: La havennumero de retservilo por esti uzata dum konekto al datumbaza projekto. Ignorita se la projekto estas malfermita per ŝparvoja dosiero. Defaŭltoj dependas de la uzata servilo-tipo (ekz. %1, %2).

# 'local-socket' command line option
source: Local computer's socket filename to be used when connecting to a database project. Ignored if the project is opened using a shortcut file. Defaults depend on the used server type (e.g. %1, %2).
eo: La ingo dosiernomo de loka komputilo por esti uzata dum konekto al datumbaza projekto. Ignorita se la projekto estas malfermita per ŝparvoja dosiero. Defaŭltoj dependas de la uzata servilo-tipo (ekz. %1, %2).

# 'skip-conn-dialog' command line option
source: Skip displaying connection dialog window and connect directly. Available when opening .kexic or .kexis shortcut files.
eo: Preterpasi montradon de konekta dialogfenestro kaj konekti rekte. Disponebla kiam oni malfermas .kexic aŭ .kexis ŝparvojajn dosierojn.

# 'fullscreen' command line option
source: Start KEXI in full screen mode to occupy the whole screen area by hiding window decorations such as title bars.
eo: Komenci KEXI en plenekrana reĝimo por okupi la tutan ekranan areon kaŝante fenestrajn ornamojn kiel titolbretojn.

# 'list-plugins' command line option
source: Displays list of plugins available for KEXI with their name, description, version and filenames.
eo: Montras liston de aldonaĵoj disponeblaj por KEXI kun sia nomo, priskribo, versio kaj dosiernomoj.

source: Could not find location to save connection data file.
eo: Ne eblis trovi lokon por konservi konektan datumdosieron.

source: Could not create folder <filename>%1</filename> for connection data file.
eo: Ne eblis krei dosierujon <filename>%1</filename> por datumdosiero de konektoj.

source: Could not remove connection file <filename>%1</filename>.
eo: Ne eblis forigi konektan dosieron <filename>%1</filename>.

source: All Supported Files
eo: Ĉiuj Subtenataj Dosieroj

source: All Files
eo: Ĉiuj dosieroj

source: Unknown error
eo: Nekonata eraro

source: Details:
eo: Detaloj:

# @info
source: Object <resource>%1</resource> could not be opened in Design View.
eo: Objekto <resource>%1</resource> ne povus esti malfermita en Dezajna vido.

source: Object could not be opened in Data View.
eo: Objekto ne povus esti malfermita en Data View.

source: Do you want to open it in Text View?
eo: Ĉu vi volas malfermi ĝin en Teksta Vido?

source: object
eo: objekto

source: Could not create object's window.
eo: Ne eblis krei la fenestron de objekto.

source: The plugin or object definition may be corrupted.
eo: La kromaĵo aŭ objektodifino povas esti koruptita.

source: Could not load object's definition.
eo: Ne eblis ŝargi la difinon de objekto.

source: Object design may be corrupted.
eo: Objektdezajno povas esti koruptita.

# @info
source: You can delete <resource>%1</resource> object and create it again.
eo: Vi povas forigi objekton <resource>%1</resource> kaj krei ĝin denove.

source: Could not load object's data.
eo: Ne eblis ŝargi la datumojn de objekto.

# @info
source: Data identifier: <resource>%1</resource>.
eo: Datumidentigilo: <resource>%1</resource>.

source: Design in SQL View
eo: Dezajno en SQL-Vido

source: Design in Text View
eo: Dezajno en Teksta Vido

# @info
source: Create new object of type <resource>%1</resource>
eo: Krei novan objekton de tipo <resource>%1</resource>

# @info
source: Creates new object of type <resource>%1</resource>
eo: Kreas novan objekton de tipo <resource>%1</resource>

# @info
source: Could not load plugin file <filename>%1</filename> for <application>%2</application>.
eo: Ne eblis ŝargi kromprogramon <filename>%1</filename> por <application>%2</application>.

# @info
source: Could not open plugin <filename>%1</filename> for <application>%2</application>.
eo: Ne eblis malfermi aldonaĵon <filename>%1</filename> por <application>%2</application>.

# @info
source: <para>Could not find any plugins for <application>%1</application>, e.g. for tables or forms. <application>%1</application> would not be functional so it will exit.</para><para><note>Please check if <application>%1</application> is properly installed.</note></para>
eo: <para>Ne eblis trovi ajnajn kromaĵojn por <application>%1</application>, ekz. por tabeloj aŭ formoj. <application>%1</application> ne funkcius do ĝi eliros.</para><para><note>Bonvolu kontroli ĉu <application>%1</application> estas ĝuste instalita.</note></para>

# @info
source: <para><note>No single <filename>%1</filename> directory has been located so it is possible that custom plugin configuration was requested but it is not set up properly. Set the <envar>QT_PLUGIN_PATH</envar> environment variable properly before running <application>%2</application>.</note></para>
eo: <para><note>Neniu sola <filename>%1</filename> dosierujo troviĝis do eblas, ke laŭmenda aldonaĵagordo estis petita sed ĝi ne estas agordita ĝuste. Agordu la mediovariablon <envar>QT_PLUGIN_PATH</envar> ĝuste antaŭ ol ruli <application>%2</application>.</note></para>

# @info
source: No plugin for ID <resource>%1</resource>
eo: Neniu kromaĵo por ID <resource>%1</resource>

source: Could not set empty name for this object.
eo: Ne eblis agordi malplenan nomon por ĉi tiu objekto.

# @info
source: Could not use this name. Object <resource>%1</resource> already exists.
eo: Ne eblis uzi ĉi tiun nomon. Objekto <resource>%1</resource> jam ekzistas.

# @info
source: Could not rename object <resource>%1</resource>.
eo: Ne eblis renomi objekton <resource>%1</resource>.

# @info
source: Could not open project <resource>%1</resource>.
eo: Ne eblis malfermi projekton <resource>%1</resource>.

# @info
source: Could not open project. The project file <filename>%1</filename> does not exist.
eo: Ne eblis malfermi projekton. La projektdosiero <filename>%1</filename> ne ekzistas.

# @title:window
source: Could Not Open File
eo: Ne Eblis Malfermi Dosieron

# @info (don't add tags around %1, it's done already)
source: Database project %1 does not appear to have been created using Kexi and cannot be opened. It is an SQLite file created using other tools.
eo: La datumbaza projekto %1 ŝajnas ne esti kreita per Kexi kaj ne povas esti malfermita. Ĝi estas SQLite-dosiero kreita per aliaj iloj.

# @info
source: Could not create project <resource>%1</resource>.
eo: Ne eblis krei projekton <resource>%1</resource>.

source: Project major version
eo: Projekta ĉefa versio

source: Project minor version
eo: Projekta negrava versio

source: Project caption
eo: Projektoteksto

source: Project description
eo: Projekta priskribo

source: Could not load list of tables.
eo: Ne eblis ŝargi liston de tabeloj.

# @info
source: Opening object <resource>%1</resource> failed. %2 %3
eo: Malfermo de objekto <resource>%1</resource> malsukcesis. %2 %3

source: This project is opened as read only.
eo: Ĉi tiu projekto estas malfermita kiel nurlegebla.

source: Could not delete object's user data.
eo: Ne eblis forigi la uzantdatenojn de objekto.

# warning
source: Entire project's data and design will be deleted.
eo: La datumoj kaj dezajno de la tuta projekto estos forigitaj.

# @info (don't add tags around %1, it's done already)
source: <para>The project %1 already exists.</para><para>Do you want to replace it with a new, blank one?</para><para><warning>%2</warning></para>
eo: <para >La projekto %1 jam ekzistas.</para><para >Ĉu vi volas anstataŭigi ĝin per nova, malplena?</para><para><warning>%2</warning></para>

# @action:button
source: Replace
eo: Anstataŭigi

# @info
source: <para>Do you want to delete the project <resource>%1</resource>?</para><para><warning>%2</warning></para>
eo: <para>Ĉu vi volas forigi la projekton <resource>%1</resource>?</para><para><warning>%2</warning></para>

# @action:button
source: Delete Project
eo: Forigi Projekton

source: Could not delete this project. Database connection for this project has been opened as read only.
eo: Ne eblis forigi ĉi tiun projekton. Datumbaza konekto por ĉi tiu projekto estis malfermita kiel nurlegebla.

source: Open As Read Only
eo: Malfermi Kiel Nur-Lega

# @info
source: <para>Could not open file <filename>%1</filename> for reading and writing.</para><para>Do you want to open the file as read only?</para>
eo: <para>Ne eblis malfermi la dosieron <filename>%1</filename> por legado kaj skribo.</para><para >Ĉu vi volas malfermi la dosieron kiel nur-lega?</para>

# @info database connection
source: <resource>%1</resource> (connection <resource>%2</resource>)
eo: <resource>%1</resource> (konekto <resource>%2</resource>)

source: File <filename>%1</filename> contains no connection information.
eo: Dosiero <filename>%1</filename> enhavas neniujn informojn pri konekto.

source: File <filename>%1</filename> does not contain group <resource>%2</resource>.
eo: Dosiero <filename>%1</filename> ne enhavas grupon <resource>%2</resource>.

source: Invalid value <resource>%1</resource> type specified in group <resource>%2</resource> of file <filename>%3</filename>.
eo: Nevalida valoro <resource>%1</resource> specifita en grupo <resource>%2</resource> de dosiero <filename>%3</filename>.

source: No valid "engine" field specified in group <resource>%1</resource> of file <filename>%2</filename>.
eo: Neniu valida kampo "motoro" specifita en grupo <resource>%1</resource> de dosiero <filename>%2</filename>.

source: Could not create folder <filename>%1</filename> for storing recent projects information.
eo: Ne eblis krei dosierujon <filename>%1</filename> por konservi informojn pri lastatempaj projektoj.

source: &Ascending
eo: Kresk&anta

source: Sort data in ascending order
eo: Ordigi datumojn en kreskanta ordo

source: Sorts data in ascending order (from A to Z and from 0 to 9). Data from selected column is used for sorting.
eo: Ordigas datumojn en kreskanta ordo (de A ĝis Z kaj de 0 ĝis 9). Datumoj de elektita kolumno estas uzataj por ordigo.

source: &Descending
eo: &Malkreskanta

source: Sort data in descending order
eo: Ordigi datumojn en malkreskanta ordo

source: Sorts data in descending (from Z to A and from 9 to 0). Data from selected column is used for sorting.
eo: Ordigas datumojn malkreske (de Z ĝis A kaj de 9 ĝis 0). Datumoj de elektita kolumno estas uzataj por ordigo.

# <file> argument description for the command line
source: Kexi database project filename, Kexi shortcut filename, or name of a Kexi database project on a server to open.
eo: Kexi datumbaza projekto dosiernomo, Kexi ŝparvoja dosiernomo, aŭ nomo de Kexi datumbaza projekto sur servilo por malfermi.

source: Switch to visual design view
eo: Ŝalti al viddezajn-vido

source: Switches to visual design view.
eo: Ŝanĝas al vida dezajno-vido.
