Repository: KDE/kexi
Catalog: po/*/kexi.po
Languages: eo

source: &Font...
eo: &Tiparo...

source: Change font for selected object
eo: Ŝanĝi tiparon por elektita objekto

source: Changes font for selected object.
eo: Ŝanĝas tiparon por elektita objekto.

source: &Next Window
eo: Sekva Fe&nestro

source: Next window
eo: Sekva fenestro

source: Switches to the next window.
eo: Ŝaltas al la sekva fenestro.

source: &Previous Window
eo: &Antaŭa Fenestro

source: Previous window
eo: Antaŭa fenestro

source: Switches to the previous window.
eo: Ŝaltas al la antaŭa fenestro.

source: &Close Tab
eo: &Fermi langeton

source: Close the current tab
eo: Fermi la nunan langeton

source: Closes the current tab.
eo: Fermas la nunan langeton.

source: Cl&ose All Tabs
eo: Fermu ĉiujn langetojn

source: Close all tabs
eo: Fermi ĉiujn langetojn

source: Closes all tabs.
eo: Fermas ĉiujn langetojn.

source: This shows useful tips on the use of this application.
eo: Tiu montras helpajn konsilojn por uzi tiun aplikaĵon.

source: &File
eo: &Dosiero

source: &Edit
eo: R&edakti

source: &Find/Replace
eo: &Trovi/Anstataŭigi

source: &Data
eo: &Datumoj

source: &Tools
eo: &Iloj

source: &Settings
eo: &Agordoj

source: &Window
eo: Fe&nestro

# Report a bug or wish for KEXI application
source: Report a &Bug or Wish...
eo: Raporti &Cimon aŭ Deziron...

source: Files a bug or wish for KEXI application.
eo: Enskribas cimon aŭ deziron por KEXI-aplikaĵo.

source: Activates a "What's This?" tool.
eo: Aktivigas ilon "Kio ĉi tio?".

source: Help
eo: Helpo

source: Shows KEXI Handbook.
eo: Montras KEXI-Manlibron.

source: Shows information about KEXI application.
eo: Montras informojn pri KEXI-apliko.

source: Shows information about KDE.
eo: Montras informojn pri KDE.

source: <br/>(reason: <i>%1</i>)
eo: <br/>(kialo: <i>%1</i>)

# @info (don't add tags around %1, it's done already)
source: Database project %1 does not appear to have been created using <application>%2</application>.<nl/>Do you want to import it as a new KEXI project?
eo: La datumbaza projekto %1 ŝajnas ne esti kreita per <application>%2</application>.<nl/>Ĉu vi volas importi ĝin kiel novan KEXI-projekton?

# @action:button Import Database
source: &Import...
eo: &Importi...

# @window:title
source: Select New Project's Location
eo: Elekti la Lokon de Nova Projekto

source: cannot create object - unknown object type "%1"
eo: ne povas krei objekton - nekonata objektotipo "%1"

source: unknown object type "%1"
eo: nekonata objektotipo "%1"

source: cannot create object of type "%1"
eo: ne povas krei objekton de tipo "%1"

# "executing object" action
source: executing
eo: rulanta

source: opening
eo: malfermanta

source: table not found
eo: tabelo ne trovita

source: query not found
eo: aldemando ne trovita

source: macro not found
eo: makroo ne trovita

source: script not found
eo: skripto ne trovita

source: object not found
eo: objekto ne trovita

source: cannot execute object
eo: ne povas lanĉi objekton

source: cannot open object
eo: ne povas malfermi objekton

source: You have requested selected objects to be automatically opened or processed on startup. Several objects cannot be opened or processed.
eo: Vi petis elektitajn objektojn por esti aŭtomate malfermitaj aŭ prilaboritaj dum ekfunkciigo. Pluraj objektoj ne povas esti malfermitaj aŭ prilaboritaj.

# <project-name> (read only)
source: %1 (read only)
eo: %1 (nurlega)

source: From File...
eo: El Dosiero...

source: From Server...
eo: De Servilo...

# @info
source: Selected view is not supported for <resource>%1</resource> object.
eo: Elektita vido ne estas subtenata por <resource>%1</resource> objekto.

# @info
source: Selected view (%1) is not supported by this object type (%2).
eo: Elektita vido (%1) ne estas subtenata de ĉi tiu objektotipo (%2).

# Could not save object under the original name.
source: Could not save under the original name.
eo: Ne eblis konservi sub la originala nomo.

# @action:button Save object
source: Save
eo: Konservi

# @title:window
source: Save Object As
eo: Konservi Objekton Kiel

# @info Saving object failed
source: Saving <resource>%1</resource> object failed.
eo: Konservado de <resource>%1</resource> objekto malsukcesis.

source: Save changes
eo: Konservi ŝanĝojn

# @info
source: Saves all recent changes made in <resource>%1</resource> object.
eo: Konservas ĉiujn lastatempajn ŝanĝojn faritajn en <resource>%1</resource> objekto.

# @info
source: Discards all recent changes made in <resource>%1</resource> object.
eo: Forĵetas ĉiujn lastatempajn ŝanĝojn faritajn en <resource>%1</resource> objekto.

source: Do you want to save changes?
eo: Ĉu vi volas konservi ŝanĝojn?

# opening is not allowed in "data view/design view/text view" mode
source: opening is not allowed in "%1" mode
eo: malfermo ne estas permesita en "%1" reĝimo

# @info
source: Tab for <resource>%1</resource> (%2).
eo: Langeto por <resource>%1</resource> (%2).

# @info
source: Tab for <resource>%1</resource>.
eo: Langeto por <resource>%1</resource>.

# @info Delete <objecttype> <objectname>?
source: <para>Do you want to permanently delete the following object?<nl/><nl/>%1 <resource>%2</resource></para><para><note>If you click <interface>Delete</interface>, you will not be able to undo the deletion.</note></para>
eo: <para>Ĉu vi volas porĉiame forigi la jenan objekton?<nl/><nl/>%1 <resource>%2</resource></para><para><note>Se vi klakas <interface>Forigi</interface>, vi ne povos malfari la forigon.</note></para>

# @title:window Delete Object %1.
source: Delete <resource>%1</resource>?
eo: Ĉu forigi <resource>%1</resource>?

source: Could not delete object.
eo: Ne eblis forigi objekton.

# @info
source: <para>Before renaming object <resource>%1</resource> it should be closed.</para><para>Do you want to close it?</para>
eo: <para>Antaŭ renomi objekton <resource>%1</resource> ĝi estu fermita.</para><para >Ĉu vi volas fermi ĝin?</para>

source: Close Window and Rename
eo: Fermu Fenestron kaj Alinomi

# @info
source: Renaming object <resource>%1</resource> failed.
eo: Alinomado de objekto <resource>%1</resource> malsukcesis.

# @info
source: Setting caption for object <resource>%1</resource> failed.
eo: Agordo de bildoteksto por objekto <resource>%1</resource> malsukcesis.

source: Compacting database file <filename>%1</filename> is not supported.
eo: Kompaktado de datumbaza dosiero <filename>%1</filename> ne estas subtenata.

# @action:button Compact database
source: Compact
eo: Kompakta

source: The current project has to be closed before compacting the database. It will be open again after compacting. Do you want to continue?
eo: La nuna projekto devas esti fermita antaŭ kompakti la datumbazon. Ĝi estos denove malfermita post kompaktado. Ĉu vi volas daŭrigi?

# @info
source: Design of query <resource>%1</resource> that you want to export data from is changed and has not yet been saved. Do you want to use data from the changed query for exporting or from its original (saved) version?
eo: Dezajno de la demando <resource>%1</resource>, el kiu vi volas eksporti datumojn, estas ŝanĝita kaj ankoraŭ ne estas konservita. Ĉu vi volas uzi datumojn de la ŝanĝita demando por eksporti aŭ de ĝia originala (konservita) versio?

# @action:button Export query data
source: Use the Changed Query
eo: Uzu la Ŝanĝitan Demandon

# @action:button Export query data
source: Use the Original Query
eo: Uzu la Originalan Demandon

source: Task-oriented toolbar. Groups commands using tabs.
eo: Task-orientita ilobreto. Grupigas komandojn uzante langetojn.

source: Create
eo: Krei

source: Form Design
eo: Formo-Dezajno

source: Report Design
eo: Raporta Dezajno

# @info
source: Could not start <application>%1</application> application.
eo: Ne eblis lanĉi la aplikaĵon <application>%1</application>.

# @info
source: Command <command>%1</command> failed.
eo: Komando <command>%1</command> malsukcesis.

source: Join us on:
eo: Aliĝu al ni ĉe:

source: Visit KEXI Facebook page at %1
eo: Viziti KEXI Fejsbukan paĝon ĉe %1

source: Visit KEXI Twitter page at %1
eo: Viziti KEXI Tviterpaĝon ĉe %1

source: Visit Calligra home page at %1
eo: Viziti la ĉefpaĝon de Calligra ĉe %1

# @info
source: <para>Could not open icon resource file <filename>%1</filename>.</para><para><application>%2</application> will not start. Please check if it is properly installed.</para>
eo: <para>Ne eblis malfermi ikonan rimedan dosieron <filename>%1</filename>.</para><para><application>%2</application> ne komenciĝos. Bonvolu kontroli ĉu ĝi estas ĝuste instalita.</para>

# @info Tried to find files in <dir list>
source: Tried to find in %1.
eo: Provis trovi en %1.

# @info
source: Could not open icon resource file <filename>%1</filename>. Please check if <application>%2</application> is properly installed.
eo: Ne eblis malfermi ikonan rimedan dosieron <filename>%1</filename>. Bonvolu kontroli ĉu <application>%2</application> estas ĝuste instalita.

# Tools->Locate textbox' placeholder text with shortcut
source: Locate (%1)
eo: Trovi (%1)

source: Try Again
eo: Provi denove

# @title:window
source: New Project
eo: Nova Projekto

# @info
source: <application>%1</application> will create a new database project. Select blank database.
eo: <application>%1</application> kreos novan datumbazan projekton. Elektu malplenan datumbazon.

source: Blank Projects
eo: Blankaj Projektoj

source: Blank database
eo: Blanka datumbazo

source: Database project without any objects
eo: Datumbaza projekto sen ajna objekto

source: Contacts
eo: Kontaktoj

source: Movie catalog
eo: Filmkatalogo

source: Templates
eo: Ŝablonoj:

# @title:window
source: Storage Method
eo: Stokado-Metodo

# @info
source: Select a storage method which will be used to store the new project.
eo: Elekti konservan metodon, kiu estos uzata por konservi la novan projekton.

source: New database
eo: Nova datumbazo

# @title:window
source: Project Caption & Filename
eo: Projekto Titolo & Dosiernomo

# @info
source: Enter caption for the new project. Filename will be created automatically based on the caption. You can change the filename too.
eo: Enigu bildotekston por la nova projekto. Dosiernomo estos kreita aŭtomate surbaze de la bildoteksto. Vi ankaŭ povas ŝanĝi la dosiernomon.

source: Enter project caption.
eo: Enigi projektan titolon.

# @info
source: <para><filename>%1</filename> is a relative path.</para><para><note>Enter absolute path of a file to be created.</note></para>
eo: <para><filename>%1</filename> estas relativa vojo.</para><para><note>Enigu absolutan vojon de kreota dosiero.</note></para>

source: Enter a valid project filename. The file should be located on this computer.
eo: Enigu validan projektan dosiernomon. La dosiero devus troviĝi sur ĉi tiu komputilo.

# @info
source: <para><filename>%1</filename> is a directory name.</para><para><note>Enter name of a file to be created.</note></para>
eo: <para><filename>%1</filename> estas dosieruja nomo.</para><para><note>Enigu nomon de kreota dosiero.</note></para>

# @info
source: <para>Could not create database file <filename>%1</filename>.</para><para><note>There is no permission to create this file. Pick another directory or change permissions so the file can be created.</note></para>
eo: <para>Ne eblis krei datumbazan dosieron <filename>%1</filename>.</para><para><note>Ne estas permeso krei ĉi tiun dosieron. Elektu alian dosierujon aŭ ŝanĝu permesojn por ke la dosiero estu kreita.</note></para>

# @title:window
source: Creating Project
eo: Kreante Projekton

# @info
source: Please wait while the project is created.
eo: Bonvolu atendi dum la projekto estas kreita.

# @title:window
source: Database Connection
eo: Datumbaza Konekto

# @info
source: <para>Select database server's connection you wish to use to create a new KEXI project.</para><para>Here you may also add, edit or delete connections from the list.</para>
eo: <para>Elektu la konekton de datumbaza servilo, kiun vi volas uzi por krei novan KEXI-projekton.</para><para>Ĉi tie vi ankaŭ povas aldoni, redakti aŭ forigi konektojn el la listo.</para>

# @title:window
source: Project Caption & Database Name
eo: Projekta Titolo & Datumbaza Nomo

# @info
source: Enter caption for the new project. Database name will be created automatically based on the caption. You can change the database name too.
eo: Enigu bildotekston por la nova projekto. Datumbaza nomo estos kreita aŭtomate surbaze de la bildoteksto. Vi ankaŭ povas ŝanĝi la datumbazan nomon.

# @info
source: Existing project databases on <resource>%1 (%2)</resource> database server:
eo: Ekzistantaj projektaj datumbazoj sur <resource>%1 (%2)</resource> datumbaza servilo:

source: Enter database name.
eo: Enigu datumbazan nomon.

source: Database with this name already exists. Do you want to delete it and create a new one?
eo: Datumbazo kun ĉi tiu nomo jam ekzistas. Ĉu vi volas forigi ĝin kaj krei novan?

source: Delete and Create New
eo: Forigi kaj Krei Novan

source: <b>Select existing KEXI project file to open:</b>
eo: <b>Elektu ekzistantan projektodosieron KEXI por malfermi:</b>

source: &Advanced
eo: &Altnivela

source: Click "Advanced" button if you want to find an existing project on a server rather than a file.
eo: Alklaku la butonon "Altnivela" se vi volas trovi ekzistantan projekton en servilo prefere ol dosiero.

# @title:window
source: Open Project
eo: Malfermi Projekton

# @info
source: Select project to open. You can choose project stored in file or on database server.
eo: Elektu projekton malfermendan. Vi povas elekti projekton konservitan en dosiero aŭ sur datumbaza servilo.

# @title:tab
source: Projects Stored in File
eo: Projektoj Stokitaj en Dosiero

# @title:tab
source: Projects Stored on Database Server
eo: Projektoj Stokitaj sur Datumbaza Servilo

# @info
source: <para>Select database server's connection with project you wish to open.</para><para>Here you may also add, edit or delete connections from the list.</para>
eo: <para>Elektu la konekton de datumbaza servilo kun projekto kiun vi volas malfermi.</para><para>Ĉi tie vi ankaŭ povas aldoni, redakti aŭ forigi konektojn el la listo.</para>

# @title:window
source: Open Project on Database Server
eo: Malfermi Projekton sur Datumbaza Servilo

# @info
source: Select project on database server <resource>%1 (%2)</resource> to open.
eo: Elektu projekton sur datumbaza servilo <resource>%1 (%2)</resource> por malfermi.

# @title:window
source: Database Password
eo: Pasvorto de datumbazo

# New Project Stored in File
source: File
eo: Dosiero

source: New Project Stored in File
eo: Nova Projekto Stokita en Dosiero

# New Project Stored on Database Server
source: Server
eo: Servilo

source: New Project Stored on Database Server
eo: Nova Projekto Stokita sur Datumbaza Servilo

source: Opened less than minute ago
eo: Malfermita antaŭ malpli ol minuto

source: on local server
eo: sur loka servilo

# @info
source: on <resource>%1</resource> server
eo: sur <resource>%1</resource> servilo

# @info File database <file>
source: File database <filename>%1</filename>
eo: Dosiera datumbazo <filename>%1</filename>

source: database
eo: Datumbazo

# <type> database, e.g. PostgreSQL database, MySQL database
source: %1 database
eo: %1 datumbazo

source: Last opened on %1
eo: Laste malfermita je %1

source: Project caption:
eo: Titolo de la projekto:

source: Project's database name:
eo: Nomo de datumbazo de projekto:

# Plugin name
source: Name:
eo: Nomo:

# Plugin description
source: Description:
eo: Priskribo:

# Plugin version
source: Version:
eo: Versio:

# Plugin fileName
source: File:
eo: Dosiero:

source: No KEXI plugins found.
eo: Neniuj KEXI-aldonaĵoj trovitaj.

source: KEXI plugins (%1):
eo: KEXI-aldonaĵoj (%1):

source: No KDb database driver plugins found.
eo: Neniuj KDb datumbaza ŝoforaldonaĵoj trovitaj.

source: KDb database driver plugins (%1):
eo: KDb datumbaza ŝoforaldonaĵoj (%1):

# @info
source: <para>Could not read connection information from connection shortcut file <filename>%1</filename>.</para><para><note>Check whether the file has valid contents.</note></para>
eo: <para>Ne eblis legi informojn pri konekto el koneksa ŝparvoja dosiero <filename>%1</filename>.</para><para><note>Kontrolu ĉu la dosiero havas validan enhavon.</note></para>

# Please don't translate the "type" word, it's constant.
source: <icode>%1</icode> is not valid value for <icode>--type</icode> command-line option. Possible value can be <icode>%2</icode>, <icode>%3</icode> or <icode>%4</icode>
eo: <icode>%1</icode> ne validas valoro por <icode>--type</icode> komandlinia opcio. Ebla valoro povas esti <icode>%2</icode>, <icode>%3</icode> aŭ <icode>%4</icode>

source: Invalid port number <icode>%1</icode> specified.
eo: Nevalida portnumero <icode>%1</icode> specifita.

source: Could not open database. No database driver specified.
eo: Ne eblis malfermi datumbazon. Neniu datumbaza pelilo specifita.

# @info
source: Could not start <application>%1</application> application this way.
eo: Ne eblis lanĉi la aplikaĵon <application>%1</application> tiamaniere.

# Please don't translate the "createdb" and "dropdb" words, these are constants.
source: Both <icode>createdb</icode> and <icode>dropdb</icode> used in startup options.
eo: Kaj <icode>createdb</icode> kaj <icode>dropdb</icode> uzataj en startopcioj.

source: No project name specified.
eo: Neniu projektonomo specifita.

source: Both <icode>user-mode</icode> and <icode>design-mode</icode> used in startup options.
eo: Kaj <icode>uzantreĝimo</icode> kaj <icode>dezajna reĝimo</icode> uzataj en startopcioj.

# @info
source: Could not delete project. The file <filename>%1</filename> does not exist.
eo: Ne eblis forigi projekton. La dosiero <filename>%1</filename> ne ekzistas.

# @info
source: Could not open shortcut file <filename>%1</filename>.
eo: Ne eblis malfermi ŝparvojan dosieron <filename>%1</filename>.

# @info
source: Could not open connection data file <filename>%1</filename>.
eo: Ne eblis malfermi konektan datumdosieron <filename>%1</filename>.

source: You have specified a few database objects to be opened automatically, using startup options. These options will be ignored because they are not available while creating or dropping projects.
eo: Vi specifis kelkajn datumbazobjektojn por esti malfermotaj aŭtomate, uzante startopciojn. Ĉi tiuj opcioj estos ignoritaj ĉar ili ne estas disponeblaj dum kreado aŭ forigo de projektoj.

# @info
source: Project <resource>%1</resource> created successfully.
eo: Projekto <resource>%1</resource> kreita sukcese.

# @info
source: Project <resource>%1</resource> dropped successfully.
eo: Projekto <resource>%1</resource> sukcese malkonstruita.

# @info
source: Could not open file. Missing filename.
eo: Ne eblis malfermi dosieron. Mankas dosiernomo.

# @info
source: Could not open file. The file <filename>%1</filename> does not exist.
eo: Ne eblis malfermi dosieron. La dosiero <filename>%1</filename> ne ekzistas.

# @info
source: <para>Could not open file <filename>%1</filename> for reading.</para><para><note>Check the file's permissions and whether it is already opened and locked by another application.</note></para>
eo: <para>Ne eblis malfermi dosieron <filename>%1</filename> por legado.</para><para><note>Kontrolu la permesojn de la dosiero kaj ĉu ĝi estas jam malfermita kaj ŝlosita de alia aplikaĵo.</note></para>

# @info
source: <para>Could not open project.</para><para>The file <filename>%1</filename> is not readable. Check the file's permissions and whether it is already opened and locked by another application.</para>
eo: <para >Ne eblis malfermi projekton.</para><para >La dosiero <filename>%1</filename> ne estas legebla. Kontrolu la permesojn de la dosiero kaj ĉu ĝi jam estas malfermita kaj ŝlosita de alia aplikaĵo.</para>

# @info
source: <para><filename>%1</filename> is an external file of type <resource>%2</resource>.</para><para>Do you want to import the file as a KEXI project?</para>
eo: <para><filename>%1</filename> estas ekstera dosiero de tipo <resource>%2</resource>.</para><para >Ĉu vi volas importi la dosieron kiel KEXI-projekton?</para >

source: Open External File
eo: Malfermi Eksteran Dosieron

# @action:button Import File
source: Import...
eo: Importi...

# @info
source: The project file <filename>%1</filename> is recognized as compatible with <resource>%2</resource> database driver, while you have asked for <resource>%3</resource> database driver to be used. Do you want to use <resource>%4</resource> database driver?
eo: La projektdosiero <filename>%1</filename> estas rekonita kiel kongrua kun <resource>%2</resource> datumbaza pelilo, dum vi petis ke datumbaza pelilo <resource>%3</resource> estu uzata. Ĉu vi volas uzi datumbazpelilon <resource>%4</resource>?

source: Possible problems: %1
eo: Eblaj problemoj: %1

# @info
source: The file <filename>%1</filename> is not recognized as being supported by <application>%2</application>.
eo: La dosiero <filename>%1</filename> ne estas agnoskita kiel subtenata de <application>%2</application>.

# @info
source: <para>Could not find plugin supporting for this file type.</para><para>Detected MIME type is <resource>%1</resource>%2.</para>
eo: <para>Ne eblis trovi kromprogramon subtenantan por ĉi tiu dosiertipo.</para><para>Detektita MIME-tipo estas <resource>%1</resource>%2.</para>

# @info
source: <para>Could not find plugin supporting for this file type.</para><para>Detected MIME type is <resource>%1</resource>%2.</para><para>%3</para>
eo: <para>Ne eblis trovi kromprogramon subtenantan por ĉi tiu dosiertipo.</para><para>Detektita MIME-tipo estas <resource>%1</resource>%2.</para><para>%3</para>

source: Could not load list of available projects for <resource>%1</resource> database server.
eo: Ne eblis ŝargi liston de disponeblaj projektoj por <resource>%1</resource> datumbaza servilo.

source: Failed saving connection data to <filename>%1</filename> file.
eo: Malsukcesis konservi konektajn datumojn al <filename>%1</filename> dosiero.

source: Create Project
eo: Krei Projekton

source: Open Existing Project
eo: Malfermi Ekzistantan Projekton

source: Choose Project
eo: Elekti Projekton

source: Do not show me this dialog again
eo: Ne montri ĉi tiun dialogon denove

source: Click <interface>OK</interface> button to proceed.
eo: Alklaki la butonon <interface>OK</interface> por daŭrigi.

source: Blank Database
eo: Malplena Datumbazo

source: New Blank Database Project
eo: Nova Malplena Datumbazprojekto

source: Kexi will create a new blank database project.
eo: Kexi kreos novan malplenan datumbazan projekton.

source: Import Existing Database
eo: Importi Ekzistantan datumbazon

source: Import Existing Database as New Database Project
eo: Importi Ekzistantan datumbazon kiel Novan Datumbaz-Projekton

source: Kexi will import the structure and data of an existing database as a new database project.
eo: Kexi importos la strukturon kaj datumojn de ekzistanta datumbazo kiel nova datumbaza projekto.

# @title:window
source: Welcome to KEXI
eo: Bonvenon al KEXI

# @info
source: Select one of the recently used projects to open.
eo: Elekti unu el la lastatempe uzataj projektoj por malfermi.
