Repository: KDE/kexi
Catalog: po/*/kexi.po
Languages: eo

source: Switch to text view
eo: Ŝalti al tekstvido

source: Switches to text view.
eo: Ŝaltas al tekstvido.

# @info:tooltip
source: Menu for <resource>%1</resource>
eo: Menuo por <resource>%1</resource>

source: Shows context menu for the current view.
eo: Montras kuntekstan menuon por la aktuala vido.

source: Save current design
eo: Konservi aktualan dezajnon

source: Saves changes made to the current design.
eo: Konservas ŝanĝojn faritajn al la nuna dezajno.

# @action:button Visual Design
source: Visual
eo: Vida

source: Could not create new object.
eo: Ne eblis krei novan objekton.

source: Save Changes
eo: Konservi Ŝanĝojn

source: Do Not Switch
eo: Ne Ŝalti

# @info
source: <para>There are unsaved changes in object <resource>%1</resource>.</para><para>Do you want to save these changes before switching to other view?</para>
eo: <para >Estas nekonservitaj ŝanĝoj en objekto <resource>%1</resource>.</para><para >Ĉu vi volas konservi ĉi tiujn ŝanĝojn antaŭ ol ŝanĝi al alia vido?</para>

source: Confirm Saving Changes
eo: Konfirmu Konservadon de Ŝanĝoj

source: Design has been changed. You must save it before switching to other view.
eo: Dezajno estis ŝanĝita. Vi devas konservi ĝin antaŭ ol ŝanĝi al alia vido.

source: Switching to other view failed (%1).
eo: Ŝanĝi al alia vido malsukcesis (%1).

source: Saving object's definition failed.
eo: Konservado de la difino de objekto malsukcesis.

source: Saving object's data failed.
eo: Konservado de la datumoj de objekto malsukcesis.

# (qtundo-format)
source: Change <resource>%1</resource> property for multiple widgets
eo: Ŝanĝi <resource>%1</resource> posedaĵon por pluraj fenestraĵoj

# (qtundo-format)
source: Change <resource>%1</resource> property for widget <resource>%2</resource>
eo: Ŝanĝi trajton <resource>%1</resource> por fenestraĵo <resource>%2</resource>

# (qtundo-format)
source: Move multiple widgets
eo: Movu plurajn fenestraĵojn

# (qtundo-format)
source: Align Widgets to Grid
eo: Vicigi Fenestraĵojn al Krado

# (qtundo-format)
source: Align Widgets to Left
eo: Vicigi Fenestraĵojn al Maldekstre

# (qtundo-format)
source: Align Widgets to Right
eo: Vicigi Fenestraĵojn dekstren

# (qtundo-format)
source: Align Widgets to Top
eo: Vicigi Fenestraĵojn al la Supro

# (qtundo-format)
source: Align Widgets to Bottom
eo: Vicigi Fenestraĵojn al Malsupro

# (qtundo-format)
source: Resize Widgets to Grid
eo: Regrandigi Fenestraĵojn al Krado

# (qtundo-format)
source: Resize Widgets to Fit Contents
eo: Regrandigi Fenestraĵojn por Konveni Enhavon

# (qtundo-format)
source: Resize Widgets to Narrowest
eo: Regrandigi Fenestraĵojn al Plej Mallarĝa

# (qtundo-format)
source: Resize Widgets to Widest
eo: Regrandigi Fenestraĵojn al Plej Larĝe

# (qtundo-format)
source: Resize Widgets to Shortest
eo: Regrandigi Fenestraĵojn al Plej Mallonga

# (qtundo-format)
source: Resize Widgets to Tallest
eo: Regrandigi Fenestraĵojn al Plej Altaj

# (qtundo-format)
source: Insert widget <resource>%1</resource>
eo: Enigi fenestraĵon <resource>%1</resource>

# (qtundo-format)
source: Insert widget
eo: Enmeti fenestraĵon

# @info
source: Could not insert widget of type <resource>%1</resource>. A problem with widget's creation encountered.
eo: Ne eblis enmeti fenestraĵon de tipo <resource>%1</resource>. Problemo kun kreado de fenestraĵo renkontita.

# (qtundo-format)
source: Paste
eo: Alglui

# (qtundo-format)
source: Delete widget
eo: Forigi fenestraĵon

# (qtundo-format)
source: Duplicate widget
eo: Duobla fenestraĵo

# (qtundo-format)
source: Cut
eo: Eltondi

# (qtundo-format)
source: Add Page
eo: Aldoni Paĝon

source: Page %1
eo: Paĝo %1

# (qtundo-format)
source: Delete Page
eo: Forigi Paĝon

# @title:window
source: Edit Form Connections
eo: Redakti Formkonektojn

source: &New Connection
eo: &Nova Konekto

source: &Delete Connection
eo: &Forigi Konekton

source: OK?
eo: BONE?

source: Connection correctness
eo: Ĝusteco de konekto

source: Sender
eo: Sendinto

source: Signal
eo: Signalo

source: Receiver
eo: Ricevonto

source: Slot
eo: Fako

source: The connection is OK.
eo: La konekto estas bona.

source: The connection is invalid.
eo: La konekto estas malvalida.

source: You have not selected item: <resource>%1</resource>.
eo: Vi ne elektis eron: <resource>%1</resource>.

source: The signal/slot arguments are not compatible.
eo: La signalo/fendo-argumentoj ne estas kongruaj.

source: Do you want to delete this connection?
eo: Ĉu vi volas forigi ĉi tiun konekton?

# @action:button
source: &Delete Connection
eo: &Forigi Konekton

# @title:window
source: Edit Listview Contents
eo: Redakti Listvido-Enhavon

source: Columns
eo: Kolumnoj

source: &Add Item
eo: &Aldoni Eron

source: New &Subitem
eo: Nova &Subelemento

source: &Delete Item
eo: &Forigi Eron

source: Move Item &Up
eo: Movu Eron S&upren

source: Move Item &Down
eo: Movi Eron &Suben

source: Contents
eo: Enhavo

source: Caption
eo: Titolo

source: Width
eo: Larĝo

source: Clickable
eo: Klakebla

source: Resizable
eo: Regrandigebla

source: Full Width
eo: Plena Larĝo

source: New Column
eo: Nova Kolumno

source: New Item
eo: Nova ero

source: Sub Item
eo: Sub-Ero

source: Form
eo: Formo

# @info
source: Renaming widget <resource>%1</resource> to <resource>%2</resource> failed.
eo: Alinomado de fenestraĵo <resource>%1</resource> al <resource>%2</resource> malsukcesis.

source: Widget name could not be empty.
eo: La nomo de la fenestraĵo ne povis esti malplena.

# @info
source: Could not rename widget <resource>%1</resource> to <resource>%2</resource> because <resource>%3</resource> is not a valid name (identifier) for a widget.
eo: Ne eblis renomi fenestraĵon <resource>%1</resource> al <resource>%2</resource> ĉar <resource>%3</resource> ne estas valida nomo (identigilo) por fenestraĵo.

# @info
source: Could not rename widget <resource>%1</resource> to <resource>%2</resource> because a widget with the name <resource>%3</resource> already exists.
eo: Ne eblis renomi fenestraĵo <resource>%1</resource> al <resource>%2</resource> ĉar fenestraĵo kun la nomo <resource>%3</resource> jam ekzistas.

source: Multiple Widgets (%1)
eo: Multoblaj Fenestraĵoj (%1)

source: %1 : Form
eo: %1 : Formo

source: No Buddy
eo: Neniu kamarado

# Translators: please keep this string short (less than 20 chars)
source: Hor. Alignment
eo: Hor. Alĝustigo

source: Horizontal Alignment
eo: Horizontala alĝustigo

# Translators: please keep this string short (less than 20 chars)
source: Ver. Alignment
eo: Ver. Alĝustigo

source: Vertical Alignment
eo: Vertikala alĝustigo

source: Name
eo: Nomo

source: Window title
eo: Fenestra titolo

source: Text
eo: Teksto

source: Background Pixmap
eo: Fona Bildmapo

# Property: enabled widget
source: Enabled
eo: Ebligita

source: Geometry
eo: Geometrio

source: Size Policy
eo: Grandeca Politiko

source: Minimum Size
eo: Minimuma grando

source: Maximum Size
eo: Maksimuma Grandeco

source: Font
eo: Tiparo

source: Cursor
eo: Kursoro:

source: Foreground Color
eo: Malfona Koloro

source: Background Color
eo: Fonkoloro

source: Fill Background
eo: Plenigi Fonon

source: Focus Policy
eo: Fokusa Politiko

source: Margin
eo: Marĝeno

source: Read Only
eo: Nurlegebla

source: Style Sheet
eo: Stila Folio

# Widget's Tooltip
source: Tooltip
eo: Konsileto

# Widget's Whats This
source: What's This
eo: Kio estas tio

source: Icon Size
eo: Piktograma grando

source: Frame
eo: Framo

source: Frame Width
eo: Kadro-Larĝo

source: Mid Frame Width
eo: Meza Kadro-Larĝo

source: Frame Shape
eo: Kadro Formo

source: Frame Shadow
eo: Kadro Ombro

source: Vertical Scrollbar
eo: Vertikala Rulumbreto

source: Horizontal Scrollbar
eo: Horizontala Rulumbreto

source: No Background
eo: Neniu Fono

source: Palette Foreground
eo: Paletro Malfono

# Auto (HINT: for AutoText)
source: Auto
eo: Aŭtomate

# Auto (HINT: for Align)
source: Auto
eo: Aŭtomate

# Baseline (HINT: for Align)
source: Baseline
eo: Bazlinio

# Left (HINT: for Align)
source: Left
eo: Maldekstre

# Right (HINT: for Align)
source: Right
eo: Dekstra

# Center (HINT: for Align)
source: Center
eo: Centrigita

# Justify (HINT: for Align)
source: Justify
eo: Pravigi

# Top (HINT: for Align)
source: Top
eo: Supro

# Bottom (HINT: for Align)
source: Bottom
eo: Malsupre

# No Frame (HINT: for Frame Shape)
source: No Frame
eo: Neniu Kadro

# Box (HINT: for Frame Shape)
source: Box
eo: Skatolo

# Panel (HINT: for Frame Shape)
source: Panel
eo: Panelo

# Windows Panel (HINT: for Frame Shape)
source: Windows Panel
eo: Vindoza Panelo

# Horiz. Line (HINT: for Frame Shape)
source: Horiz. Line
eo: Horiz. Linio

# Vertical Line (HINT: for Frame Shape)
source: Vertical Line
eo: Vertikala Linio

# Styled (HINT: for Frame Shape)
source: Styled
eo: Stilita

# Popup (HINT: for Frame Shape)
source: Popup
eo: Ŝpruco

# Menu Bar (HINT: for Frame Shape)
source: Menu Bar
eo: Menua Trinkejo

# Toolbar (HINT: for Frame Shape)
source: Toolbar
eo: Ilobreto

# Text Box (HINT: for Frame Shape)
source: Text Box
eo: Tekstujo

# Tab Widget (HINT: for Frame Shape)
source: Tab Widget
eo: Tab Fenestraĵo

# Group Box (HINT: for Frame Shape)
source: Group Box
eo: Grupazono

# Plain (HINT: for Frame Shadow)
source: Plain
eo: Simpla

# Raised (HINT: for Frame Shadow)
source: Raised
eo: Levita

# Sunken (HINT: for Frame Shadow)
source: Sunken
eo: Alfundiĝinta

# for Frame Shadow
source: Internal
eo: Interna

# No Focus (HINT: for Focus)
source: No Focus
eo: Neniu Fokuso

# Tab (HINT: for Focus)
source: Tab
eo: Tabo

# Click (HINT: for Focus)
source: Click
eo: Kliki

# Tab/Click (HINT: for Focus)
source: Tab/Click
eo: Tab/Alklaki

# Tab/Click/MouseWheel (HINT: for Focus)
source: Tab/Click/Mouse Wheel
eo: Tab/Klako/Musrado

source: Auto
eo: Aŭtomata

source: Always Off
eo: Ĉiam Malŝaltita

source: Always On
eo: Ĉiam Enŝaltita

source: Horizontal
eo: Horizontala

source: Vertical
eo: Vertikala

source: Left to Right
eo: Liva al Dekstra

source: Right to Left
eo: Dekstra al Liva

source: Qt Designer UI Files
eo: Qt Designer UI-Dosieroj

source: No action
eo: Neniu agado

source: Application actions
eo: Aplikaj agoj

# Current form's actions
source: Current
eo: Aktuala

source: Open in Data View
eo: Malfermi en Datuma Vido

source: Execute
eo: Lanĉi

# Note: use multiple rows if needed
source: Export to File As Data Table
eo: Eksporti al Dosiero Kiel Datuma Tabelo

# Note: use multiple rows if needed
source: Copy to Clipboard As Data Table
eo: Kopii al Tondujo Kiel Datuma Tabelo

source: Create New Object (%1)
eo: Krei Novan Objekton (%1)

source: Open in Design View
eo: Malfermi en Dezajna Vido

source: Close View
eo: Fermi rigardon

source: &Select action to be executed after clicking <resource>%1</resource> button:
eo: Elektu agon plenumendan po&st klako de la butono <resource>%1</resource>:

source: &Select macro to be executed after clicking <resource>%1</resource> button:
eo: Elektu makroon plenumendan po&st klako de la butono <resource>%1</resource>:

source: &Select script to be executed after clicking <resource>%1</resource> button:
eo: Elektu &skripton plenumendan post klako de la butono <resource>%1</resource>:

source: &Select object to be opened after clicking <resource>%1</resource> button:
eo: Elektu objekton malfermendan po&st klako de la butono <resource>%1</resource>:

# @title:window
source: Assigning Action to Button
eo: Atribui Agon al Butono

source: Action category:
eo: Agokategorio:

source: Action to execute:
eo: Ago por efektivigi:

# Assign action
source: &Assign
eo: &Atribui

source: Assign action
eo: Atribui agon

# @title:window
source: Edit Rich Text
eo: Redakti Riĉan Tekston

source: Bold
eo: Grasa

source: Italic
eo: Kursiva

source: Underline
eo: Substrekita

source: Superscript
eo: Superskribo

source: Subscript
eo: Subskribo

source: Left Align
eo: Maldekstre vicigi

source: Centered
eo: Centre

source: Right Align
eo: Dekstre Vicigi

source: Justified
eo: Pravigita

# @title:window
source: Edit Tab Order
eo: Redakti Tab-Ordon

source: Move Up
eo: Movi supren

source: Move widget up
eo: Movi fenestraĵon supren

source: Move Down
eo: Movi malsupren

source: Move widget down
eo: Movi fenestraĵon malsupren

source: Handle tab order automatically
eo: Pritrakti sinsekvon de langetoj aŭtomate

# @title:window
source: Edit Contents of %1
eo: Redakti Enhavon de %1

source: Could not find any form widget plugins.
eo: Ne eblis trovi iujn ajn formularajn fenestraĵaldonaĵojn.

# @info
source: Could not load Form Widgets plugin file <filename>%1</filename> for <application>%2</application>.
eo: Ne eblis ŝargi la kromdosieron de Form Widgets <filename>%1</filename> por <application>%2</application>.

# @info
source: Could not open Form Widgets plugin <filename>%1</filename> for <application>%2</application>.
eo: Ne eblis malfermi aldonaĵon de Form Widgets <filename>%1</filename> por <application>%2</application>.

# Insert Horizontal Widget
source: Insert Horizontal
eo: Enmeti Horizontalan

# Insert Vertical Widget
source: Insert Vertical
eo: Enmeti Vertikalan

source: Insert Widget: %1
eo: Enmeti Fenestraĵon: %1

source: Cancel
eo: Rezigni

# Tab widget's page
source: Tab Page
eo: Tab-Paĝo

# Widget's type
source: Type
eo: Tipo

source: Widget name
eo: Fenestraĵ-nomo

# Button text: Next page in assistant (wizard)
source: Next
eo: Sekva

# @info
source: <para>Could not find application style <resource>%1</resource>.</para><para><application>Kexi</application> will not start. Please check if <application>Kexi</application> is properly installed.</para>
eo: <para>Ne eblis trovi aplikan stilon <resource>%1</resource>.</para><para><application>Kexi</application> ne komenciĝos. Bonvolu kontroli ĉu <application>Kexi</application> estas ĝuste instalita.</para>

source: Open
eo: Malfermi

source: Save
eo: Konservi

# @info
source: <para>The file <filename>%1</filename> already exists.</para><para>Do you want to overwrite it?</para>
eo: <para >La dosiero <filename>%1</filename> jam ekzistas.</para><para >Ĉu vi volas anstataŭigi ĝin?</para>

# @info
source: The file or directory <filename>%1</filename> does not exist.
eo: La dosiero aŭ dosierujo <filename>%1</filename> ne ekzistas.

# @info
source: Invalid hyperlink <link>%1</link>.
eo: Nevalida hiperligo <link>%1</link>.

# @info
source: Executable <link>%1</link> not allowed.
eo: Efektivigebla <link>%1</link> ne permesita.

# @info
source: Remote hyperlink <link>%1</link> not allowed.
eo: Fora hiperligo <link>%1</link> ne permesita.

# @info
source: Do you want to run this file?<warning>Running executables can be dangerous.</warning>
eo: Ĉu vi volas ruli ĉi tiun dosieron?<warning>Ruli ekzekutaĵojn povas esti danĝera.</warning>

# @action:button Run script file
source: Run
eo: Kuri

source: modified
eo: modifita

# @title:window
source: Report a Bug or Wish
eo: Raportu Cimon aŭ Deziron

source: Operating system & platform:
eo: Operaciumo kaj platformo:

# Other operating system
source: Other
eo: Alia

# Other platform
source: Other
eo: Alia

source: (All fields)
eo: (Ĉiuj kampoj)

source: (Current field)
eo: (Nuna kampo)

# @title:window
source: Replace
eo: Anstataŭigi

# @title:window
source: Replace in <resource>%1</resource>
eo: Anstataŭigu en <resource>%1</resource>

# @title:window
source: Find
eo: Trovi

# @title:window
source: Find in <resource>%1</resource>
eo: Trovi en <resource>%1</resource>

source: The search item was not found
eo: La serĉaĵo ne estis trovita

# Look in field:
source: &Look in:
eo: &Rigardi en:

source: &Search:
eo: &Serĉi:

# Match: Whole words only
source: &Whole words only
eo: &Nur tutvorte

source: Fi&nd:
eo: Tro&vi:

# Replace all occurrences with
source: Re&place with:
eo: Anstataŭigi &per:

source: Prompt on replace
eo: Demando pri anstataŭigo

source: &Match:
eo: &Kongruo:

# Match: Case sensitive
source: C&ase sensitive
eo: Usklec-disting&a

# Match: Any Part of Field
source: Any Part of Field
eo: Ajna Parto de Kampo

# Match: Whole Field
source: Whole Field
eo: Tuta Kampo

# Match: Start of Field
source: Start of Field
eo: Komenco de Kampo

# Search Up
source: Up
eo: Supren

# Search Down
source: Down
eo: Malsupren

# Look In All Rows
source: All Rows
eo: Ĉiuj Vicoj

source: &Replace
eo: &Anstataŭigi

# Replace All Occurrences
source: Replace All
eo: Anstataŭigi ĉion

# Welcome global view mode
source: Welcome
eo: Bonvenon

# Project global view mode (noun)
source: Project
eo: Projekto

# Edit global view mode (verb)
source: Edit
eo: Redakti

# Design global view mode (verb)
source: Design
eo: Dezajno

# Help global view mode (noun)
source: Help
eo: Helpo

source: &New Project...
eo: &Nova Projekto...

source: Create a new project
eo: Krei novan projekton

source: Creates a new project. Currently opened project is not affected.
eo: Kreas novan projekton. Nuntempe malfermita projekto ne estas tuŝita.

source: &Open Project...
eo: Malfermi Pr&ojekton...

source: Open an existing project
eo: Malfermi ekzistantan projekton

source: Opens an existing project. Currently opened project is not affected.
eo: Malfermas ekzistantan projekton. Nuntempe malfermita projekto ne estas tuŝita.

source: Open a project that was recently opened.
eo: Malfermi projekton kiu estis lastatempe malfermita.

source: Opens a project that was recently opened.
eo: Malfermas projekton kiu estis lastatempe malfermita.

source: Welcome
eo: Bonvenon

source: Show Welcome page
eo: Montri Bonvenan paĝon

source: Shows Welcome page with list of recently opened projects and other information.
eo: Montras Bonvenan paĝon kun listo de lastatempe malfermitaj projektoj kaj aliaj informoj.

source: Save object changes
eo: Konservi objektoŝanĝojn

source: Saves object changes from currently selected window.
eo: Konservas objektoŝanĝojn de nuntempe elektita fenestro.

source: Save &As...
eo: Konservi &kiel...

source: Save object as
eo: Konservi objekton kiel

source: Saves object from currently selected window under a new name (within the same project).
eo: Konservas objekton el nun elektita fenestro sub nova nomo (ene de la sama projekto).

source: &Import, Export or Send...
eo: &Importi, Eksporti aŭ Sendi...

source: Import, export or send project
eo: Importi, eksporti aŭ sendi projekton

source: Imports, exports or sends project.
eo: Importas, eksportas aŭ sendas projekton.

source: &Close Project
eo: &Fermi Projekton

source: Close the current project
eo: Fermi la nunan projekton

source: Closes the current project.
eo: Fermas la nunan projekton.

# @info:whatsthis
source: Quits <application>%1</application> application.
eo: Forlasas la aplikaĵon <application>%1</application>.

source: &Import Database...
eo: &Importi datumbazon...

source: Import entire database as a KEXI project
eo: Importu tutan datumbazon kiel projekton KEXI

source: Imports entire database as a KEXI project.
eo: Importas tutan datumbazon kiel projekto KEXI.

source: Import Tables...
eo: Importi tabelojn...

source: Import data from an external source into this project
eo: Importi datumojn de ekstera fonto en ĉi tiun projekton

source: Imports data from an external source into this project.
eo: Importas datumojn de ekstera fonto en ĉi tiun projekton.

source: &Compact Database...
eo: &Kompaktigi datumbazon...

source: Compact the current database project
eo: Kompaktigi la aktualan datumbazprojekton

source: Compacts the current database project, so it will take less space and work faster.
eo: Kompaktigas la nunan datumbazan projekton, do ĝi prenos malpli da spaco kaj funkcios pli rapide.

# Import->Table Data From File...
source: Import Data From &File...
eo: Importi datumojn &el dosiero...

source: Import table data from a file
eo: Importi tabelajn datumojn el dosiero

source: Imports table data from a file.
eo: Importas tabelajn datumojn el dosiero.

# Export->Table or Query Data to File...
source: Export Data to &File...
eo: Eksporti Datumojn &al Dosiero...

source: Export data from the active table or query to a file
eo: Eksporti datumojn de la aktiva tabelo aŭ informpeto al dosiero

source: Exports data from the active table or query to a file.
eo: Eksportas datumojn de la aktiva tabelo aŭ demando al dosiero.

# Paste Special->As Data &Table...
source: Paste Special...
eo: Alglui Specialan...

source: Paste clipboard data as a table
eo: Alglui datumojn de la tondujo kiel tabelon

source: Pastes clipboard data as a table.
eo: Almetas datumojn de la tondujo kiel tabelon.

# Copy Special->Table or Query Data...
source: Copy Special...
eo: Kopio Speciala...

source: Copy selected table or query data to clipboard
eo: Kopii elektitan tabelon aŭ aldemandodatumojn al tondujo

source: Copies selected table or query data to clipboard.
eo: Kopias elektitajn tabelojn aŭ informpetajn datumojn al tondujo.

source: Reverts the most recent editing action.
eo: Revenigas la plej lastatempan redaktan agon.

source: Reverts the most recent undo action.
eo: Malfaras la plej lasttempan malfar-agon.

source: Find text
eo: Trovi tekston

source: Looks up the first occurrence of a piece of text.
eo: Serĉas la unuan aperon de teksto.

source: Replace All
eo: Anstataŭigi ĉion

source: &Delete
eo: &Forigi

source: Delete selected object
eo: Forigi elektitan objekton

source: Deletes currently selected object.
eo: Forigas nuntempe elektitan objekton.

source: Delete Record
eo: Forigi Rekordon

source: Delete the current record
eo: Forigi la nunan rikordon

source: Deletes the current record.
eo: Forigas la nunan rikordon.

source: Clear Table Contents...
eo: Forviŝi Tabelenhavon...

source: Clear table contents
eo: Forviŝi tabelenhavon

source: Clears table contents.
eo: Forigas tabelenhavon.

source: Edit Item
eo: Modifi eron

source: Edit currently selected item
eo: Redakti nuntempe elektitan eron

source: Edits currently selected item.
eo: Redaktas nuntempe elektitan eron.

source: &Insert Empty Row
eo: &Enmeti Malplenan Vicon

source: Insert one empty row above
eo: Enmeti unu malplenan vicon supre

source: Inserts one empty row above currently selected table row.
eo: Enmetas unu malplenan vicon super la nuntempe elektita tabelvico.

source: Show Project Navigator
eo: Montri Projektan Navigilon

source: Show the Project Navigator pane
eo: Montri la panelon de Projekta Navigilo

source: Shows the Project Navigator pane.
eo: Montras la panelon de Projekta Navigilo.

source: Activate Project Navigator
eo: Aktivigi Projektan Navigilon

source: Activate the Project Navigator pane
eo: Aktivigi la panelon de Projekta Navigilo

source: Activates the Project Navigator pane. If it is hidden, shows it first.
eo: Aktivigas la panelon de Projekta Navigilo. Se ĝi estas kaŝita, unue montras ĝin.

source: Activate main area
eo: Aktivigi ĉefan areon

source: Activate the main area
eo: Aktivigi la ĉefan areon

source: Activates the main area.
eo: Aktivigas la ĉefan areon.

source: Show Property Pane
eo: Montri Propraj Panelon

source: Show the Property pane
eo: Montri la Propraĵan panelon

source: Shows the Property pane.
eo: Montras la Propraĵo-fenestron.

source: Activate Property Pane
eo: Aktivigi Propraĵan Panelon

source: Activate the Property pane
eo: Aktivigi la Nemoveblaĵon

source: Activates the Property pane. If it is hidden, shows it first.
eo: Aktivigas la Nemoveblaĵon. Se ĝi estas kaŝita, unue montras ĝin.

source: Locate...
eo: Trovu...

source: Switch to Global Locate box
eo: Ŝanĝi al Tutmonda Loka skatolo

source: Switches to Global Locate box.
eo: Ŝanĝas al Tutmonda Loka skatolo.

source: &Accept
eo: &Akcepti

source: Accept changes made to the current record
eo: Akcepti ŝanĝojn faritajn al la nuna rekordo

source: Accepts changes made to the current record.
eo: Akceptas ŝanĝojn faritajn al la nuna rekordo.

source: &Cancel
eo: &Rezigni

source: Cancel changes made to the current record
eo: Nuligi ŝanĝojn faritajn al la nuna rekordo

source: Cancels changes made to the current record.
eo: Nuligas ŝanĝojn faritajn al la nuna rekordo.

source: &Execute
eo: &Plenumi
