Repository: KDE/kexi
Catalog: po/*/kexi.po
Languages: eo

source: A container to group some widgets
eo: Ujo por grupigi kelkajn fenestraĵojn

# 'Title' property for group box
source: Title
eo: Titolo

# 'Flat' property for group box
source: Flat
eo: Plata

source: Auto-hide Tabs
eo: Aŭtomate kaŝi langetojn

source: Tab Position
eo: Langetpozicio

# 'Current page' property for tab widget
source: Current Page
eo: Nuna Paĝo

source: Tab Shape
eo: Langetformo

# Tab Widget's property: true if can use scroll buttons
source: Scroll Buttons
eo: Rulumbutonoj

source: Closable Tabs
eo: Fermeblaj langetoj

source: Movable Tabs
eo: Moveblaj langetoj

source: Document Mode
eo: Dokumenta Reĝimo

# Property value for Tab Shape
source: Rounded
eo: Rondigita

# Property value for Tab Shape
source: Triangular
eo: Triangula

source: &Image
eo: &Bildo

source: &Assign Action...
eo: &Atribui Agon...

# default indent value
source: default
eo: norma

# Add page to tab widget
source: Add Page
eo: Aldoni Paĝon

# Delete tab widget's page
source: Delete Page
eo: Forigi Paĝon

# Rename tab widget's page
source: Rename Page...
eo: Alinomi paĝon...

# @window:title
source: New Page Title
eo: Nova Paĝa Titolo

source: Enter a new title for the current page:
eo: Enigu novan titolon por la nuna paĝo:

# Add page to a stacked widget
source: Add Page...
eo: Aldoni paĝon...

# Delete page from a stacked widget
source: Delete Page
eo: Forigi Paĝon

# Go to Previous Page of a Stacked Widget
source: Go to Previous Page
eo: Iri al Antaŭa Paĝo

# Go to Next Page of a Stacked Widget
source: Go to Next Page
eo: Iri al Sekva Paĝo

# Edit rich text for a widget
source: Edit Rich Text
eo: Redakti Riĉan Tekston

source: Copy
eo: Kopii

source: Export
eo: Eksporti

# @title:window
source: Copy Data From Table to Clipboard
eo: Kopii Datumojn De Tabelo al Tondujo

source: Copying data from table:
eo: Kopiante datumojn de tabelo:

# @title:window
source: Export Data From Table to CSV File
eo: EksportuiDatumojn De Tabelo al CSV-Dosiero

source: Exporting data from table:
eo: Eksportante datumojn de tabelo:

# @title:window
source: Copy Data From Query to Clipboard
eo: Kopii Datumojn el Informpeto al Tondujo

# @title:window
source: Export Data From Query to CSV File
eo: Eksporti Datumojn el Informpeto al CSV-Dosiero

source: Exporting data from query:
eo: Eksportante datumojn de informpeto:

source: Could not open data for exporting.
eo: Ne eblis malfermi datumojn por eksporti.

source: (rows: %1, columns: %2)
eo: (vicoj: %1, kolumnoj: %2)

source: (columns: %1)
eo: (kolumnoj: %1)

source: Enter Name of File You Want to Save Data To
eo: Enigu la Nomon de Dosiero Al Vi Deziras Konservi Datumojn

source: To CSV file:
eo: Al CSV-dosiero:

source: To clipboard.
eo: Al tondujo.

source: Show Options &gt;&gt;
eo: Montri Opciojn >>

source: Delimiter:
eo: Limigilo:

source: Text quote:
eo: Teksta citaĵo:

source: Add column names as the first row
eo: Aldoni kolumnonomojn kiel la unuan vicon

source: Defaults
eo: Aprioraĵoj

source: Always use above options for copying
eo: Ĉiam uzi ĉi-suprajn opciojn por kopii

source: Always use above options for exporting
eo: Ĉiam uzi ĉi-suprajn opciojn por eksporti

source: Copying
eo: Kopiante

source: Exporting
eo: Eksportante

source: Hide Options &lt;&lt;
eo: Kaŝi Opciojn &lt;&lt;

source: no
eo: ne

source: false
eo: falsa

# @title:window
source: Import CSV Data From File
eo: Importi CSV-datumojn de dosiero

# @title:window
source: Paste CSV Data From Clipboard
eo: Alglui CSV-datumojn el tondujo

# @action:button Import CSV
source: &Import...
eo: &Importi...

source: Data set contains no rows. Do you want to import empty table?
eo: Datenaro enhavas neniujn vicojn. Ĉu vi volas importi malplenan tabelon?

source: No database connection available.
eo: Neniu datumbaza konekto havebla.

source: Please choose other name.
eo: Bonvolu elekti alian nomon.

# @info
source: Loading CSV Data from <filename>%1</filename>...
eo: Ŝargante CSV-datumojn de <filename>%1</filename>...

# @title:window
source: Loading CSV Data
eo: Ŝargante CSV-datumojn

source: Select Import Filename
eo: Elekti Import-Dosiernomon

source: Preview of data from file:
eo: Antaŭrigardo de datumoj el dosiero:

source: Preview of data from clipboard
eo: Antaŭrigardo de datumoj el tondujo

source: Comment symbol:
eo: Simbolo de komento:

source: Primary key
eo: Primara ŝlosilo

source: Ignore duplicated delimiters
eo: Ignori duobligitajn limigilojn

source: First row contains column names
eo: La unua vico enhavas kolumnomojn

source: Import Options
eo: Import Opcioj

# @option:check CSV import: data will be appended to a new table
source: &New table
eo: &Nova tabelo

# @option:check CSV import: data will be appended to existing table
source: &Existing table
eo: &Ekzistanta tabelo

source: Choose Destination for Imported Data
eo: Elekti Celon por Importitaj Datumoj

# @label
source: Select existing table:
eo: Elekti ekzistantan tabelon:

# @label Preview of selected table
source: Table preview:
eo: Antaŭrigardo de tabelo:

# @label
source: Name:
eo: Nomo:

# @label
source: Caption:
eo: Titolo:

# @label
source: Row count:
eo: Nombro de vicoj:

# @label
source: Column count:
eo: Nombro de kolumnoj:

# @label
source: Fields:
eo: Kampoj:

# @label
source: Choose Name of Destination Table
eo: Elekti Nomon de Celotabelo

source: From CSV file:
eo: El CSV-dosiero:

source: From Clipboard
eo: El Clipboard

# @label Importing CSV data to table:
source: To table:
eo: Al tabelo:

source: Ready to Import
eo: Preta por Importi

source: Cannot open input file <filename>%1</filename>.
eo: Ne povas malfermi enigdosieron <filename>%1</filename>.

source: Start at line (1-%1):
eo: Komenci ĉe linio (1-%1):

source: Start at line:
eo: Komenci ĉe linio:

source: Column
eo: Kolumno

# @info
source: An error occurred during insert record.
eo: Okazis eraro dum enmeto de rikordo.

source: None
eo: Neniu

source: Format for column %1:
eo: Formato por kolumno %1:

# @info
source: <para>No primary key (autonumber) has been defined.</para><para>Should it be automatically defined on import (recommended)?</para><para><note>An imported table without a primary key may not be editable (depending on database type).</note></para>
eo: <para >Neniu ĉefa ŝlosilo (aŭtomata numero) estas difinita.</para><para >Ĉu ĝi estu aŭtomate difinita ĉe importo (rekomendita)?</para><para><note > Importita tabelo sen ĉefa ŝlosilo eble ne estu redaktebla (depende de la datumbazo).</note></para>

# @action:button Add Database Primary Key to a Table
source: &Add Primary Key
eo: &Aldoni Ĉefŝlosilon

# @action:button Do Not Add Database Primary Key to a Table
source: Do &Not Add
eo: &Ne aldoni

source: Cannot add column.
eo: Ne povas aldoni kolumnon.

# @title:column Column 1, Column 2, etc.
source: Column %1
eo: Kolumno %1

# @info
source: <para>Field count does not match.</para><para>Please choose another table.</para>
eo: <para >Kampkalkulo ne kongruas.</para><para >Bonvolu elekti alian tabelon.</para >

source: Importing data...
eo: Importado de datumoj...

source: Import has been canceled.
eo: Importo estas nuligita.

source: Error occurred during import.
eo: Eraro okazis dum importo.

# @info
source: Data has been successfully imported to table <resource>%1</resource>.
eo: Datumoj estis sukcese importitaj al tabelo <resource>%1</resource>.

# Text type for column
source: Text
eo: Teksto

# Numeric type for column
source: Number
eo: Nombro

# Currency type for column
source: Currency
eo: Valuto

# row count
source: (rows: %1)
eo: (linioj: %1)

# row count
source: (rows: more than %1)
eo: (linioj: pli ol %1)

source: Not all rows are visible on this preview
eo: Ne ĉiuj vicoj estas videblaj en ĉi tiu antaŭvido

# @title:row (with two spaces at the end)
source: Column name
eo: Nomo de kolumno

# @title:window
source: CSV Import Options
eo: CSV Import Opcioj

source: Text encoding
eo: Tekstokodado

source: Always use this encoding when importing CSV data files
eo: Ĉiam uzu ĉi tiun kodigon dum importado de CSV-datumdosieroj

# Date format: Auto
source: Auto
eo: Aŭtomate

source: day
eo: tago

source: month
eo: monato

source: year
eo: jaro

source: %1, %2, %3 (e.g. %4-%5-%6)
eo: %1, %2, %3 (ekz. %4-%5-%6)

source: Date format:
eo: Formo de dato:

source: Strip leading and trailing blanks off of text values
eo: Forigi antaŭajn kaj finajn spacetojn de tekstovaloroj

source: Import missing text values as empty texts
eo: Importi mankantajn tekstovalorojn kiel malplenajn tekstojn

source: Comma ","
eo: Komo ","

source: Semicolon ";"
eo: Punktokomo ";"

source: Tabulator
eo: Tabelilo

source: Space " "
eo: Spaco " "

source: Other
eo: Alia

source: Query Columns
eo: Kolumnoj de Informpeto

# No query column selected in the Query Designer
source: No column selected
eo: Neniu kolumno elektita

source: Describes field name or expression for the designed query.
eo: Priskribas kamponomon aŭ esprimon por la dezajnita informpeto.

source: Table
eo: Tabelo

source: Describes table for a given field. Can be empty.
eo: Priskribas tabelon por donita kampo. Povas esti malplena.

source: Visible
eo: Videbla

source: Describes visibility for a given field or expression.
eo: Priskribas videblecon por donita kampo aŭ esprimo.

source: Sorting
eo: Ordigado

source: Describes a way of sorting for a given field.
eo: Priskribas manieron ordigi por donita kampo.

source: Ascending
eo: Kreskante

source: Descending
eo: Malkreskante

source: Criteria
eo: Kriterio

source: Describes the criteria for a given field or expression.
eo: Priskribas la kriteriojn por donita kampo aŭ esprimo.

source: Cannot switch to data view, because query design is empty. First, please create your design.
eo: Ne povas ŝanĝi al datumvido, ĉar demanda dezajno estas malplena. Unue, bonvolu krei vian dezajnon.

# @info
source: Select column for table <resource>%1</resource>
eo: Elektu kolumnon por tabelo <resource>%1</resource>

# @info
source: Invalid criteria <icode>%1</icode>
eo: Nevalidaj kriterioj <icode>%1</icode>

# @info
source: Invalid expression <icode>%1</icode>
eo: Nevalida esprimo <icode>%1</icode>

source: Query definition loading failed.
eo: Demanda difino-ŝarĝado malsukcesis.

source: Query design may be corrupted so it could not be opened even in text view. You can delete the query and create it again.
eo: Demandodezajno povas esti koruptita do ĝi ne povus esti malfermita eĉ en tekstvido. Vi povas forigi la demandon kaj krei ĝin denove.

# short for 'expression' word (only latin letters, please)
source: expr
eo: ekspr

# @info
source: Entered column alias <resource>%1</resource> is not a valid identifier.
eo: Enigita kolumnonomo <resource>%1</resource> ne estas valida identigilo.

source: Identifiers should start with a letter or '_' character
eo: Identigiloj devas komenci per litero aŭ '_' signo

source: Could not set sorting for multiple columns (%1)
eo: Ne eblis agordi ordigon por pluraj kolumnoj (%1)

# @info
source: Could not set criteria for <resource>%1</resource>
eo: Ne eblis agordi kriteriojn por <resource>%1</resource>

source: Could not set criteria for empty record
eo: Ne eblis agordi kriteriojn por malplena registro

# Query column
source: Column
eo: Kolumno

source: Alias
eo: Alinomo

source: SQL Query Text
eo: SQL Demanda Teksto

source: Check Query
eo: Kontroli Informpeton

source: Checks query for validity.
eo: Kontrolas informpeton pri valideco.

source: The query is correct
eo: La aldemando estas ĝusta

source: The query is incorrect
eo: La aldemando estas malĝusta

source: Please enter your query and execute "Check query" function to verify it.
eo: Bonvolu enigi vian aldemandon kaj lanĉi funkcion "Kontroli informpeton" por kontroli ĝin.

# @info
source: <para>The query you entered is incorrect.</para><para>Do you want discard changes made to this SQL text and switch to the other view?</para>
eo: <para >La demando, kiun vi enigis estas malĝusta.</para><para >Ĉu vi volas forĵeti ŝanĝojn faritajn al ĉi tiu SQL-teksto kaj ŝanĝi al la alia vido?</para>

source: Discard Changes and Switch
eo: Forĵeti Ŝanĝojn kaj Ŝaltilon

source: Don't Switch
eo: Ne Ŝalti

# @info
source: <para>This query is invalid.</para><para>Do you want to save it?</para>
eo: <para >Ĉi tiu demando estas malvalida.</para><para >Ĉu vi volas konservi ĝin?</para>

source: query
eo: demando

# tooltip
source: Create new query
eo: Krei novan informpeton

# what's this
source: Creates new query.
eo: Kreas novan informpeton.

# @info:tooltip SQL query design view
source: Switch to SQL design view
eo: Ŝanĝi al SQL-dezajna vido

# @info
source: <para>You are about to delete query <resource>%1</resource> but it is used by following opened windows:</para>
eo: <para>Vi estas forigonta demandon <resource>%1</resource> sed ĝi estas uzata per sekvaj malfermitaj fenestroj:</para>

# @info
source: Design of query <resource>%1</resource> has been modified.
eo: Dezajno de la informpeto <resource>%1</resource> estas modifita.

# @info
source: Query <resource>%1</resource> already exists.
eo: Informpeto <resource>%1</resource> jam ekzistas.

# @info
source: <para>Do you want to close these windows and save the design or cancel saving?</para>
eo: <para>Ĉu vi volas fermi ĉi tiujn fenestrojn kaj konservi la dezajnon aŭ nuligi konservadon?</para>

# @action:button Close all windows and save
source: Close Windows and Save
eo: Fermi Fenestrojn kaj Konservi

# @info:tooltip Close all windows and save design
source: Close all windows and save design
eo: Fermi ĉiujn fenestrojn kaj konservi la dezajnon

# @info
source: Query <resource>%1</resource>
eo: Aldemando <resource>%1</resource>

source: Query executing failed.
eo: Rulado de informpeto malsukcesis.

source: Edit Sections
eo: Redakti Sekciojn

source: Raise
eo: Malfonigi

source: Lower
eo: Fonigi

source: report
eo: raporto

# tooltip
source: Create new report
eo: Krei novan raporton

# what's this
source: Creates new report.
eo: Kreas novan raporton.

# @info
source: Design of report <resource>%1</resource> has been modified.
eo: Dezajno de raporto <resource>%1</resource> estas modifita.

# @info
source: Report <resource>%1</resource> already exists.
eo: Raporto <resource>%1</resource> jam ekzistas.

# @info
source: Report <resource>%1</resource>
eo: Raporto <resource>%1</resource>

# Page selector label
source: Page:
eo: Paĝo:

source: Go to first page
eo: Iru al la unua paĝo

source: Goes to first page
eo: Iras al la unua paĝo

source: Go to previous page
eo: Iru al la antaŭa paĝo

source: Goes to previous page
eo: Iras al la antaŭa paĝo

source: Go to next page
eo: Iri al la sekva paĝo

source: Goes to next page
eo: Iras al la sekva paĝo

source: Go to last page
eo: Iri al la lasta paĝo

source: Goes to last page
eo: Iras al la lasta paĝo

source: Current page number
eo: Nuna paĝnumero

source: Number of pages
eo: Nombro da paĝoj

source: Print
eo: Presi

source: Print report
eo: Presi raporton

source: Prints the current report.
eo: Presas la aktualan raporton.

# @title:menu
source: E&xport As
eo: Eksportu kiel

source: Export:
eo: Eksporti:

# open dialog to export as text document
source: Text Document...
eo: Teksta Dokumento...

source: Export the report as a text document (in OpenDocument Text format)
eo: Eksporti la raporton kiel tekstan dokumenton (en OpenDocument Text-formato)

source: Exports the report as a text document (in OpenDocument Text format).
eo: Eksportas la raporton kiel tekstdokumenton (en OpenDocument Text-formato).

source: Export as PDF
eo: Eksporti kiel PDF

source: Exports the current report as PDF.
eo: Eksportas la nunan raporton kiel PDF.

# open dialog to export as spreadsheet
source: Spreadsheet...
eo: Tabelfolio...

source: Export the report as a spreadsheet (in OpenDocument Spreadsheet format)
eo: Eksporti la raporton kiel kalkultabelon (en OpenDocument Spreadsheet-formato)

source: Exports the report as a spreadsheet (in OpenDocument Spreadsheet format).
eo: Eksportas la raporton kiel kalkultabelon (en OpenDocument Spreadsheet-formato).

# open dialog to export as web page
source: Web Page...
eo: Retpaĝo...

source: Export the report as a web page (in HTML format)
eo: Eksporti la raporton kiel retpaĝon (en HTML-formato)

source: Exports the report as a web page (in HTML format).
eo: Eksportas la raporton kiel retpaĝon (en HTML-formato).

source: Printing the report failed.
eo: Presi la raporton malsukcesis.

source: Print Failed
eo: Presi Malsukcesis

source: Export Report as PDF
eo: Eksporti Raporton kiel PDF

source: Exporting the report as PDF to %1 failed.
eo: Eksporti la raporton kiel PDF al %1 malsukcesis.

source: Export Failed
eo: Eksporto Malsukcesis

source: Do you want to open exported document?
eo: Ĉu vi volas malfermi eksportitan dokumenton?

source: Export Report as Spreadsheet
eo: Eksporti Raporton kiel kalkultabelon

source: Failed to export the report as spreadsheet to %1.
eo: Malsukcesis eksporti la raporton kiel kalkultabelon al %1.

source: Export Report as Text Document
eo: Eksporti Raporton kiel Teksta Dokumento

source: Exporting the report as text document to %1 failed.
eo: Eksporto de la raporto kiel tekstdokumento al %1 malsukcesis.

source: Export Report as Web Page
eo: Eksporti Raporton kiel TTT-paĝon

# @info
source: <para>Would you like to use Cascading Style Sheets (CSS) in the exported web page or use HTML tables?</para><para><note>CSS give output closer to the original.</note></para>
eo: <para >Ĉu vi ŝatus uzi Kaskadajn stilfoliojn (CSS) en la eksportita retpaĝo aŭ uzi HTML-tabelojn?</para><para><note>CSS donas eligon pli proksime al la originalo.</note></para>

# @action:button
source: Use CSS
eo: Uzi CSS

# @action:button
source: Use Table
eo: Uzu Tabelon

source: Exporting the report as web page to %1 failed.
eo: Eksporto de la raporto kiel retpaĝo al %1 malsukcesis.

source: Opening failed
eo: Malfermo malsukcesis

source: Report schema appears to be invalid or corrupt
eo: Raportskemo ŝajnas nevalida aŭ korupta

source: Report's data source:
eo: La datumfonto de la raporto:

source: Execute the scripting code
eo: Efektivigi la skriptokodon

source: Executes the scripting code.
eo: Efektivigas la skriptkodon.

source: Edit
eo: Redakti

source: Edit actions
eo: Redakti agojn

source: Provides Edit menu.
eo: Provizas Redaktan menuon.

source: Configure Editor...
eo: Agordi redaktilon...

source: Configure the scripting editor
eo: Agordi la skriptredaktilon

source: Configures the scripting editor.
eo: Agordas la skriptredaktilon.

source: &Import...
eo: &Importi...

source: Import script
eo: Importi skripton

source: Imports script from a file.
eo: Importas skripton el dosiero.

source: &Export...
eo: &Eksporti...

source: Export script
eo: Eksporti skripton

source: Exports script to a file.
eo: Eksportas skripton al dosiero.

# @title:window
source: Import Script
eo: Importi Skripton

# @info
source: Could not read <filename>%1</filename>.
eo: Ne eblis legi <filename>%1</filename>.

# @title:window
source: Export Script
eo: Eksporti Skripton

# @info
source: Could not write <filename>%1</filename>.
eo: Ne eblis skribi <filename>%1</filename>.

source: Script Type
eo: Skripto-Tipo

source: The type of script
eo: La tipo de skripto

# @info
source: Execution of the script <resource>%1</resource> started.
eo: Plenumigo de la skripto <resource>%1</resource> komenciĝis.

source: Successfully executed. Time elapsed: %1ms
eo: Sukcese efektivigita. Tempo pasita: %1ms

source: script
eo: skripto

# tooltip
source: Create new script
eo: Krei novan skripton

# what's this
source: Creates new script.
eo: Kreas novan skripton.

source: Error executing script at line %1: %2
eo: Eraro dum plenumo de skripto ĉe linio %1: %2

source: KEXI Script
eo: KEXI Skripto

# @info
source: Design of script <resource>%1</resource> has been modified.
eo: Dezajno de skripto <resource>%1</resource> estas modifita.

# @info
source: Script <resource>%1</resource> already exists.
eo: Skripto <resource>%1</resource> jam ekzistas.

source: Record source:
eo: Rikordfonto:

source: Go to selected record source
eo: Iri al elektita rikordfonto

source: Bound column:
eo: Bindita kolumno:

source: Visible column:
eo: Videbla kolumno:

# (qtundo-format)
source: Change <resource>%1</resource> property for table field from <resource>%2</resource> to <resource>%3</resource>
eo: Ŝanĝi <resource>%1</resource> propraĵon por tabelkampo de <resource>%2</resource> al <resource>%3</resource>

# (qtundo-format)
source: Delete table field <resource>%1</resource>
eo: Forigi tabelkampon <resource>%1</resource>

# (qtundo-format)
source: Delete empty row at position %1
eo: Forigi malplenan vicon ĉe pozicio %1

# (qtundo-format)
source: Insert table field "%1"
eo: Enigi tabelkampon "%1"

# No table field selected in the Table Designer
source: No field selected
eo: Neniu kampo elektita

source: Additional information about the field
eo: Pliaj informoj pri la kampo

source: Field Caption
eo: Kampa Titolo

source: Describes caption for the field
eo: Priskribas bildotekston por la kampo

source: Data Type
eo: Datumtipo

source: Describes data type for the field
eo: Priskribas datumtipo por la kampo

source: Comments
eo: Komentoj

source: Describes additional comments for the field
eo: Priskribas pliajn komentojn por la kampo

source: Sets or deletes primary key
eo: Agordas aŭ forigas ĉefan ŝlosilon

source: Sets or deletes primary key for currently selected field.
eo: Agordas aŭ forigas ĉefan ŝlosilon por nuntempe elektita kampo.

# Table field
source: Field
eo: Ero

source: Subtype
eo: Subtipo

# Image object type
source: Image
eo: Bildo

source: Unsigned Number
eo: Nesubskribita Numero

source: Max Length
eo: Maksimuma Longo

source: Precision
eo: Precizeco

source: Visible Decimal Places
eo: Videblaj Decimalaj Lokoj

# Auto Decimal Places
source: Auto
eo: Aŭtomate

source: Default Width
eo: Defaŭlta Larĝo

source: Default Value
eo: Defaŭlta Valoro

source: Unique
eo: Unika

source: Required
eo: Postulita

source: Allow Zero Size
eo: Permesi Nulan Grandecon

source: Autonumber
eo: Aŭtonombro

source: Indexed
eo: Indeksita

source: Record Source
eo: Rikorda Fonto

# Record source type (in two records)
source: Record Source Type
eo: Rikordfonta Tipo

source: Bound Column
eo: Ligita Kolumno

source: Visible Column
eo: Videbla Kolumno

source: Cannot switch to data view, because table design is empty. First, please create your design.
eo: Ne povas ŝanĝi al datumvido, ĉar tabeldezajno estas malplena. Unue, bonvolu krei vian dezajnon.

# @info
source: <para>Saving changes for existing table design is now required.</para>%1
eo: <para>Konservi ŝanĝojn por ekzistanta tabeldezajno nun estas bezonata.</para>%1

# @action:button
source: Save Design and Delete Table Data
eo: Konservi Dezajnon kaj Forigi Tabelajn Datumojn

# @action:button
source: Discard Design
eo: Forĵeti Dezajnon

# (qtundo-format)
source: Change <resource>%1</resource> field name to <resource>%2</resource> and caption from <resource>%3</resource> to <resource>%4</resource>
eo: Ŝanĝi <resource>%1</resource> kamponomon al <resource>%2</resource> kaj bildotekston de <resource>%3</resource> al <resource>%4</resource>

# (qtundo-format)
source: Change data type for field <resource>%1</resource> to <resource>%2</resource>
eo: Ŝanĝi datumtipon por kampo <resource>%1</resource> al <resource>%2</resource>

# @info
source: <para>Setting autonumber requires primary key to be set for current field.</para>
eo: <para>Agordo de aŭtomata numero postulas ĉefa ŝlosilo esti agordita por nuna kampo.</para>

# @info
source: <para>Previous primary key will be deleted.</para>
eo: <para>Antaŭa ĉefŝlosilo estos forigita.</para>

# @info
source: <para>Do you want to create primary key for current field? Click <interface>Cancel</interface> to cancel setting autonumber.</para>
eo: <para>Ĉu vi volas krei ĉefan ŝlosilon por nuna kampo? Klaku <interface>Nuligi</interface> por nuligi la agordon de aŭtomata numero.</para>
